/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
pub const KHRONOS_TITLE: &'static [u8; 13usize] = b"KhronosTitle\0";
pub const KHRONOS_ALBUM: &'static [u8; 13usize] = b"KhronosAlbum\0";
pub const KHRONOS_TRACK_NUMBER: &'static [u8; 19usize] = b"KhronosTrackNumber\0";
pub const KHRONOS_ARTIST: &'static [u8; 14usize] = b"KhronosArtist\0";
pub const KHRONOS_GENRE: &'static [u8; 13usize] = b"KhronosGenre\0";

pub const SL_AUDIOMODE_WMA_LEVEL2: u32 = 2;
pub const SL_AUDIOMODE_WMA_LEVEL3: u32 = 3;
pub const SL_AUDIOMODE_WMA_LEVEL4: u32 = 4;
pub const SL_AUDIOMODE_WMAPRO_LEVELM0: u32 = 5;
pub const SL_AUDIOMODE_WMAPRO_LEVELM1: u32 = 6;
pub const SL_AUDIOMODE_WMAPRO_LEVELM2: u32 = 7;
pub const SL_AUDIOMODE_WMAPRO_LEVELM3: u32 = 8;
pub const SL_AUDIOPROFILE_REALAUDIO: u32 = 1;
pub const SL_AUDIOMODE_REALAUDIO_G2: u32 = 1;
pub const SL_AUDIOMODE_REALAUDIO_8: u32 = 2;
pub const SL_AUDIOMODE_REALAUDIO_10: u32 = 3;
pub const SL_AUDIOMODE_REALAUDIO_SURROUND: u32 = 4;
pub const SL_ENGINEOPTION_THREADSAFE: u32 = 1;
pub const SL_ENGINEOPTION_LOSSOFCONTROL: u32 = 2;
pub const SL_ENGINEOPTION_MAJORVERSION: u32 = 3;
pub const SL_ENGINEOPTION_MINORVERSION: u32 = 4;
pub const SL_ENGINEOPTION_STEPVERSION: u32 = 5;
pub const SL_ANDROID_PCM_REPRESENTATION_SIGNED_INT: u32 = 1;
pub const SL_ANDROID_PCM_REPRESENTATION_UNSIGNED_INT: u32 = 2;
pub const SL_ANDROID_PCM_REPRESENTATION_FLOAT: u32 = 3;
pub const SL_ANDROID_DATAFORMAT_PCM_EX: u32 = 4;
pub const SL_ANDROID_SPEAKER_NON_POSITIONAL: u32 = 2147483648;
pub const SL_ANDROID_SPEAKER_USE_DEFAULT: u32 = 0;
pub const SL_ANDROID_ITEMKEY_NONE: u32 = 0;
pub const SL_ANDROID_ITEMKEY_EOS: u32 = 1;
pub const SL_ANDROID_ITEMKEY_DISCONTINUITY: u32 = 2;
pub const SL_ANDROID_ITEMKEY_BUFFERQUEUEEVENT: u32 = 3;
pub const SL_ANDROID_ITEMKEY_FORMAT_CHANGE: u32 = 4;
pub const SL_ANDROIDBUFFERQUEUEEVENT_NONE: u32 = 0;
pub const SL_ANDROIDBUFFERQUEUEEVENT_PROCESSED: u32 = 1;
pub const SL_DATALOCATOR_ANDROIDSIMPLEBUFFERQUEUE: u32 = 2147485629;
pub const SL_DATALOCATOR_ANDROIDBUFFERQUEUE: u32 = 2147485630;
pub type sl_char_t = ::std::os::raw::c_char;
pub type sl_uint8_t = ::std::os::raw::c_uchar;
pub type sl_int8_t = ::std::os::raw::c_schar;
pub type sl_uint16_t = ::std::os::raw::c_ushort;
pub type sl_int16_t = ::std::os::raw::c_short;
pub type sl_uint32_t = ::std::os::raw::c_ulong;
pub type sl_int32_t = ::std::os::raw::c_long;
pub type sl_float32_t = f32;
pub type sl_float64_t = f64;
pub type SLchar = sl_char_t;
pub type SLint8 = sl_int8_t;
pub type SLuint8 = sl_uint8_t;
pub type SLint16 = sl_int16_t;
pub type SLuint16 = sl_uint16_t;
pub type SLint32 = sl_int32_t;
pub type SLuint32 = sl_uint32_t;
pub type SLfloat32 = sl_float32_t;
pub type Slfloat64 = sl_float64_t;
pub type SLboolean = SLuint32;
pub type SLmillibel = SLint16;
pub type SLmillisecond = SLuint32;
pub type SLmilliHertz = SLuint32;
pub type SLmillimeter = SLint32;
pub type SLmillidegree = SLint32;
pub type SLpermille = SLint16;
pub type SLmicrosecond = SLuint32;
pub type SLresult = SLuint32;
#[doc = " Interface ID defined as a UUID"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLInterfaceID_ {
    pub time_low: SLuint32,
    pub time_mid: SLuint16,
    pub time_hi_and_version: SLuint16,
    pub clock_seq: SLuint16,
    pub node: [SLuint8; 6usize],
}
#[test]
fn bindgen_test_layout_SLInterfaceID_() {
    assert_eq!(
        ::std::mem::size_of::<SLInterfaceID_>(),
        16usize,
        concat!("Size of: ", stringify!(SLInterfaceID_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLInterfaceID_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLInterfaceID_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLInterfaceID_>())).time_low as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLInterfaceID_),
            "::",
            stringify!(time_low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLInterfaceID_>())).time_mid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLInterfaceID_),
            "::",
            stringify!(time_mid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLInterfaceID_>())).time_hi_and_version as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SLInterfaceID_),
            "::",
            stringify!(time_hi_and_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLInterfaceID_>())).clock_seq as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLInterfaceID_),
            "::",
            stringify!(clock_seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLInterfaceID_>())).node as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SLInterfaceID_),
            "::",
            stringify!(node)
        )
    );
}
pub type SLInterfaceID = *const SLInterfaceID_;
pub type SLObjectItf = *const *const SLObjectItf_;
extern "C" {
    pub static SL_IID_NULL: SLInterfaceID;
}
#[doc = " URI-based data locator definition where locatorType must be SL_DATALOCATOR_URI"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_URI_ {
    pub locatorType: SLuint32,
    pub pURI: *const SLchar,
}
#[test]
fn bindgen_test_layout_SLDataLocator_URI_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_URI_>(),
        16usize,
        concat!("Size of: ", stringify!(SLDataLocator_URI_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_URI_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_URI_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_URI_>())).locatorType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_URI_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_URI_>())).pURI as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_URI_),
            "::",
            stringify!(pURI)
        )
    );
}
pub type SLDataLocator_URI = SLDataLocator_URI_;
#[doc = " Address-based data locator definition where locatorType must be SL_DATALOCATOR_ADDRESS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_Address_ {
    pub locatorType: SLuint32,
    pub pAddress: *mut ::std::os::raw::c_void,
    pub length: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_Address_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_Address_>(),
        24usize,
        concat!("Size of: ", stringify!(SLDataLocator_Address_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_Address_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_Address_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_Address_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_Address_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_Address_>())).pAddress as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_Address_),
            "::",
            stringify!(pAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_Address_>())).length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_Address_),
            "::",
            stringify!(length)
        )
    );
}
pub type SLDataLocator_Address = SLDataLocator_Address_;
#[doc = " IODevice-based data locator definition where locatorType must be SL_DATALOCATOR_IODEVICE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_IODevice_ {
    pub locatorType: SLuint32,
    pub deviceType: SLuint32,
    pub deviceID: SLuint32,
    pub device: SLObjectItf,
}
#[test]
fn bindgen_test_layout_SLDataLocator_IODevice_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_IODevice_>(),
        24usize,
        concat!("Size of: ", stringify!(SLDataLocator_IODevice_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_IODevice_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_IODevice_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_IODevice_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_IODevice_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_IODevice_>())).deviceType as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_IODevice_),
            "::",
            stringify!(deviceType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_IODevice_>())).deviceID as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_IODevice_),
            "::",
            stringify!(deviceID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_IODevice_>())).device as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_IODevice_),
            "::",
            stringify!(device)
        )
    );
}
pub type SLDataLocator_IODevice = SLDataLocator_IODevice_;
#[doc = " OutputMix-based data locator definition where locatorType must be SL_DATALOCATOR_OUTPUTMIX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_OutputMix_ {
    pub locatorType: SLuint32,
    pub outputMix: SLObjectItf,
}
#[test]
fn bindgen_test_layout_SLDataLocator_OutputMix_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_OutputMix_>(),
        16usize,
        concat!("Size of: ", stringify!(SLDataLocator_OutputMix_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_OutputMix_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_OutputMix_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_OutputMix_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_OutputMix_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_OutputMix_>())).outputMix as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_OutputMix_),
            "::",
            stringify!(outputMix)
        )
    );
}
pub type SLDataLocator_OutputMix = SLDataLocator_OutputMix_;
#[doc = " BufferQueue-based data locator definition where locatorType must be SL_DATALOCATOR_BUFFERQUEUE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_BufferQueue_ {
    pub locatorType: SLuint32,
    pub numBuffers: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_BufferQueue_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_BufferQueue_>(),
        8usize,
        concat!("Size of: ", stringify!(SLDataLocator_BufferQueue_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_BufferQueue_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLDataLocator_BufferQueue_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_BufferQueue_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_BufferQueue_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_BufferQueue_>())).numBuffers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_BufferQueue_),
            "::",
            stringify!(numBuffers)
        )
    );
}
pub type SLDataLocator_BufferQueue = SLDataLocator_BufferQueue_;
#[doc = " ContentPipe-based data locator definition where locatorType must be SL_DATALOCATOR_CONTENTPIPE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_ContentPipe_ {
    pub locatorType: SLuint32,
    pub pContentPipe: *mut ::std::os::raw::c_void,
    pub pURI: *const SLchar,
}
#[test]
fn bindgen_test_layout_SLDataLocator_ContentPipe_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_ContentPipe_>(),
        24usize,
        concat!("Size of: ", stringify!(SLDataLocator_ContentPipe_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_ContentPipe_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_ContentPipe_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_ContentPipe_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_ContentPipe_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_ContentPipe_>())).pContentPipe as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_ContentPipe_),
            "::",
            stringify!(pContentPipe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_ContentPipe_>())).pURI as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_ContentPipe_),
            "::",
            stringify!(pURI)
        )
    );
}
pub type SLDataLocator_ContentPipe = SLDataLocator_ContentPipe_;
#[doc = " MidiBufferQueue-based data locator definition where locatorType must be SL_DATALOCATOR_MIDIBUFFERQUEUE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_MIDIBufferQueue_ {
    pub locatorType: SLuint32,
    pub tpqn: SLuint32,
    pub numBuffers: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_MIDIBufferQueue_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_MIDIBufferQueue_>(),
        12usize,
        concat!("Size of: ", stringify!(SLDataLocator_MIDIBufferQueue_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_MIDIBufferQueue_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLDataLocator_MIDIBufferQueue_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_MIDIBufferQueue_>())).locatorType as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_MIDIBufferQueue_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_MIDIBufferQueue_>())).tpqn as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_MIDIBufferQueue_),
            "::",
            stringify!(tpqn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_MIDIBufferQueue_>())).numBuffers as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_MIDIBufferQueue_),
            "::",
            stringify!(numBuffers)
        )
    );
}
pub type SLDataLocator_MIDIBufferQueue = SLDataLocator_MIDIBufferQueue_;
#[doc = " MIME-type-based data format definition where formatType must be SL_DATAFORMAT_MIME"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataFormat_MIME_ {
    pub formatType: SLuint32,
    pub pMimeType: *const SLchar,
    pub containerType: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataFormat_MIME_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataFormat_MIME_>(),
        24usize,
        concat!("Size of: ", stringify!(SLDataFormat_MIME_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataFormat_MIME_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataFormat_MIME_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_MIME_>())).formatType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_MIME_),
            "::",
            stringify!(formatType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_MIME_>())).pMimeType as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_MIME_),
            "::",
            stringify!(pMimeType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_MIME_>())).containerType as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_MIME_),
            "::",
            stringify!(containerType)
        )
    );
}
pub type SLDataFormat_MIME = SLDataFormat_MIME_;
#[doc = " PCM-type-based data format definition where formatType must be SL_DATAFORMAT_PCM"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataFormat_PCM_ {
    pub formatType: SLuint32,
    pub numChannels: SLuint32,
    pub samplesPerSec: SLuint32,
    pub bitsPerSample: SLuint32,
    pub containerSize: SLuint32,
    pub channelMask: SLuint32,
    pub endianness: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataFormat_PCM_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataFormat_PCM_>(),
        28usize,
        concat!("Size of: ", stringify!(SLDataFormat_PCM_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataFormat_PCM_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLDataFormat_PCM_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).formatType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(formatType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).numChannels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(numChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).samplesPerSec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(samplesPerSec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).bitsPerSample as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(bitsPerSample)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).containerSize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(containerSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).channelMask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(channelMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_>())).endianness as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_),
            "::",
            stringify!(endianness)
        )
    );
}
pub type SLDataFormat_PCM = SLDataFormat_PCM_;
#[doc = " PCM-type-based data format definition where formatType must be SL_DATAFORMAT_PCM_EX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataFormat_PCM_EX_ {
    pub formatType: SLuint32,
    pub numChannels: SLuint32,
    pub sampleRate: SLuint32,
    pub bitsPerSample: SLuint32,
    pub containerSize: SLuint32,
    pub channelMask: SLuint32,
    pub endianness: SLuint32,
    pub representation: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataFormat_PCM_EX_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataFormat_PCM_EX_>(),
        32usize,
        concat!("Size of: ", stringify!(SLDataFormat_PCM_EX_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataFormat_PCM_EX_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLDataFormat_PCM_EX_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).formatType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(formatType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).numChannels as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(numChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).bitsPerSample as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(bitsPerSample)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).containerSize as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(containerSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).channelMask as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(channelMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).endianness as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(endianness)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataFormat_PCM_EX_>())).representation as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataFormat_PCM_EX_),
            "::",
            stringify!(representation)
        )
    );
}
pub type SLDataFormat_PCM_EX = SLDataFormat_PCM_EX_;
#[doc = " MediaObject-type-based data format definition where formatType must be SL_DATAFORMAT_MEDIAOBJECT"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_MediaObject_ {
    pub locatorType: SLuint32,
    pub mediaObject: SLObjectItf,
}
#[test]
fn bindgen_test_layout_SLDataLocator_MediaObject_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_MediaObject_>(),
        16usize,
        concat!("Size of: ", stringify!(SLDataLocator_MediaObject_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_MediaObject_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataLocator_MediaObject_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_MediaObject_>())).locatorType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_MediaObject_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_MediaObject_>())).mediaObject as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_MediaObject_),
            "::",
            stringify!(mediaObject)
        )
    );
}
pub type SLDataLocator_MediaObject = SLDataLocator_MediaObject_;
#[doc = " NULL-type-based data format definition where formatType must be SL_DATAFORMAT_NULL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_Null_ {
    pub locatorType: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_Null_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_Null_>(),
        4usize,
        concat!("Size of: ", stringify!(SLDataLocator_Null_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_Null_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLDataLocator_Null_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataLocator_Null_>())).locatorType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_Null_),
            "::",
            stringify!(locatorType)
        )
    );
}
pub type SLDataLocator_Null = SLDataLocator_Null_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataSource_ {
    pub pLocator: *mut ::std::os::raw::c_void,
    pub pFormat: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SLDataSource_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataSource_>(),
        16usize,
        concat!("Size of: ", stringify!(SLDataSource_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataSource_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataSource_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataSource_>())).pLocator as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataSource_),
            "::",
            stringify!(pLocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataSource_>())).pFormat as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataSource_),
            "::",
            stringify!(pFormat)
        )
    );
}
pub type SLDataSource = SLDataSource_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataSink_ {
    pub pLocator: *mut ::std::os::raw::c_void,
    pub pFormat: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SLDataSink_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataSink_>(),
        16usize,
        concat!("Size of: ", stringify!(SLDataSink_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataSink_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDataSink_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataSink_>())).pLocator as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataSink_),
            "::",
            stringify!(pLocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDataSink_>())).pFormat as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataSink_),
            "::",
            stringify!(pFormat)
        )
    );
}
pub type SLDataSink = SLDataSink_;
extern "C" {
    pub static SL_IID_OBJECT: SLInterfaceID;
}
#[doc = " Object callback"]
pub type slObjectCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLObjectItf,
        pContext: *const ::std::os::raw::c_void,
        event: SLuint32,
        result: SLresult,
        param: SLuint32,
        pInterface: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLObjectItf_ {
    pub Realize: ::std::option::Option<
        unsafe extern "C" fn(self_: SLObjectItf, async_: SLboolean) -> SLresult,
    >,
    pub Resume: ::std::option::Option<
        unsafe extern "C" fn(self_: SLObjectItf, async_: SLboolean) -> SLresult,
    >,
    pub GetState: ::std::option::Option<
        unsafe extern "C" fn(self_: SLObjectItf, pState: *mut SLuint32) -> SLresult,
    >,
    pub GetInterface: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLObjectItf,
            iid: SLInterfaceID,
            pInterface: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLObjectItf,
            callback: slObjectCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub AbortAsyncOperation: ::std::option::Option<unsafe extern "C" fn(self_: SLObjectItf)>,
    pub Destroy: ::std::option::Option<unsafe extern "C" fn(self_: SLObjectItf)>,
    pub SetPriority: ::std::option::Option<
        unsafe extern "C" fn(self_: SLObjectItf, priority: SLuint32) -> SLresult,
    >,
    pub GetPriority: ::std::option::Option<
        unsafe extern "C" fn(self_: SLObjectItf, pPriority: *mut SLuint32) -> SLresult,
    >,
    pub SetLossOfControlInterfaces: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLObjectItf,
            numInterfaces: SLuint16,
            pInterfaceIDs: *const SLInterfaceID,
            enabled: SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLObjectItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLObjectItf_>(),
        80usize,
        concat!("Size of: ", stringify!(SLObjectItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLObjectItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLObjectItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).Realize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(Realize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).Resume as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(Resume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).GetState as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(GetState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).GetInterface as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(GetInterface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).RegisterCallback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLObjectItf_>())).AbortAsyncOperation as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(AbortAsyncOperation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).Destroy as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(Destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).SetPriority as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(SetPriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLObjectItf_>())).GetPriority as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(GetPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLObjectItf_>())).SetLossOfControlInterfaces as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLObjectItf_),
            "::",
            stringify!(SetLossOfControlInterfaces)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioInputDescriptor_ {
    pub pDeviceName: *mut SLchar,
    pub deviceNameLength: SLint16,
    pub deviceConnection: SLint16,
    pub deviceScope: SLint16,
    pub deviceLocation: SLint16,
    pub isForTelephony: SLboolean,
    pub minSampleRate: SLmilliHertz,
    pub maxSampleRate: SLmilliHertz,
    pub isFreqRangeContinuous: SLboolean,
    pub pSamplingRatesSupported: *mut SLmilliHertz,
    pub numOfSamplingRatesSupported: SLint16,
    pub maxChannels: SLint16,
}
#[test]
fn bindgen_test_layout_SLAudioInputDescriptor_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioInputDescriptor_>(),
        48usize,
        concat!("Size of: ", stringify!(SLAudioInputDescriptor_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioInputDescriptor_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioInputDescriptor_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).pDeviceName as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(pDeviceName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).deviceNameLength as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(deviceNameLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).deviceConnection as *const _
                as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(deviceConnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).deviceScope as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(deviceScope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).deviceLocation as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(deviceLocation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).isForTelephony as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(isForTelephony)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).minSampleRate as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(minSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).maxSampleRate as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(maxSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).isFreqRangeContinuous as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(isFreqRangeContinuous)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).pSamplingRatesSupported as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(pSamplingRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).numOfSamplingRatesSupported
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(numOfSamplingRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioInputDescriptor_>())).maxChannels as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioInputDescriptor_),
            "::",
            stringify!(maxChannels)
        )
    );
}
pub type SLAudioInputDescriptor = SLAudioInputDescriptor_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioOutputDescriptor_ {
    pub pDeviceName: *mut SLchar,
    pub deviceNameLength: SLint16,
    pub deviceConnection: SLint16,
    pub deviceScope: SLint16,
    pub deviceLocation: SLint16,
    pub isForTelephony: SLboolean,
    pub minSampleRate: SLmilliHertz,
    pub maxSampleRate: SLmilliHertz,
    pub isFreqRangeContinuous: SLboolean,
    pub pSamplingRatesSupported: *mut SLmilliHertz,
    pub numOfSamplingRatesSupported: SLint16,
    pub maxChannels: SLint16,
}
#[test]
fn bindgen_test_layout_SLAudioOutputDescriptor_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioOutputDescriptor_>(),
        48usize,
        concat!("Size of: ", stringify!(SLAudioOutputDescriptor_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioOutputDescriptor_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioOutputDescriptor_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).pDeviceName as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(pDeviceName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).deviceNameLength as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(deviceNameLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).deviceConnection as *const _
                as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(deviceConnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).deviceScope as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(deviceScope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).deviceLocation as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(deviceLocation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).isForTelephony as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(isForTelephony)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).minSampleRate as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(minSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).maxSampleRate as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(maxSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).isFreqRangeContinuous as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(isFreqRangeContinuous)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).pSamplingRatesSupported as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(pSamplingRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).numOfSamplingRatesSupported
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(numOfSamplingRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioOutputDescriptor_>())).maxChannels as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioOutputDescriptor_),
            "::",
            stringify!(maxChannels)
        )
    );
}
pub type SLAudioOutputDescriptor = SLAudioOutputDescriptor_;
extern "C" {
    pub static SL_IID_AUDIOIODEVICECAPABILITIES: SLInterfaceID;
}
pub type SLAudioIODeviceCapabilitiesItf = *const *const SLAudioIODeviceCapabilitiesItf_;
pub type slAvailableAudioInputsChangedCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLAudioIODeviceCapabilitiesItf,
        pContext: *mut ::std::os::raw::c_void,
        deviceID: SLuint32,
        numInputs: SLuint32,
        isNew: SLboolean,
    ),
>;
pub type slAvailableAudioOutputsChangedCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLAudioIODeviceCapabilitiesItf,
        pContext: *mut ::std::os::raw::c_void,
        deviceID: SLuint32,
        numOutputs: SLuint32,
        isNew: SLboolean,
    ),
>;
pub type slDefaultDeviceIDMapChangedCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLAudioIODeviceCapabilitiesItf,
        pContext: *mut ::std::os::raw::c_void,
        isOutput: SLboolean,
        numDevices: SLuint32,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioIODeviceCapabilitiesItf_ {
    pub GetAvailableAudioInputs: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            pNumInputs: *mut SLuint32,
            pInputDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub QueryAudioInputCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            deviceId: SLuint32,
            pDescriptor: *mut SLAudioInputDescriptor,
        ) -> SLresult,
    >,
    pub RegisterAvailableAudioInputsChangedCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            callback: slAvailableAudioInputsChangedCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub GetAvailableAudioOutputs: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            pNumOutputs: *mut SLuint32,
            pOutputDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub QueryAudioOutputCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            deviceId: SLuint32,
            pDescriptor: *mut SLAudioOutputDescriptor,
        ) -> SLresult,
    >,
    pub RegisterAvailableAudioOutputsChangedCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            callback: slAvailableAudioOutputsChangedCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub RegisterDefaultDeviceIDMapChangedCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            callback: slDefaultDeviceIDMapChangedCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub GetAssociatedAudioInputs: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            deviceId: SLuint32,
            pNumAudioInputs: *mut SLuint32,
            pAudioInputDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetAssociatedAudioOutputs: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            deviceId: SLuint32,
            pNumAudioOutputs: *mut SLuint32,
            pAudioOutputDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetDefaultAudioDevices: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            defaultDeviceID: SLuint32,
            pNumAudioDevices: *mut SLuint32,
            pAudioDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub QuerySampleFormatsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioIODeviceCapabilitiesItf,
            deviceId: SLuint32,
            samplingRate: SLmilliHertz,
            pSampleFormats: *mut SLint32,
            pNumOfSampleFormats: *mut SLuint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAudioIODeviceCapabilitiesItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioIODeviceCapabilitiesItf_>(),
        88usize,
        concat!("Size of: ", stringify!(SLAudioIODeviceCapabilitiesItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioIODeviceCapabilitiesItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioIODeviceCapabilitiesItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).GetAvailableAudioInputs
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(GetAvailableAudioInputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).QueryAudioInputCapabilities
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(QueryAudioInputCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>()))
                .RegisterAvailableAudioInputsChangedCallback as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(RegisterAvailableAudioInputsChangedCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).GetAvailableAudioOutputs
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(GetAvailableAudioOutputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).QueryAudioOutputCapabilities
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(QueryAudioOutputCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>()))
                .RegisterAvailableAudioOutputsChangedCallback as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(RegisterAvailableAudioOutputsChangedCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>()))
                .RegisterDefaultDeviceIDMapChangedCallback as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(RegisterDefaultDeviceIDMapChangedCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).GetAssociatedAudioInputs
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(GetAssociatedAudioInputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).GetAssociatedAudioOutputs
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(GetAssociatedAudioOutputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).GetDefaultAudioDevices
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(GetDefaultAudioDevices)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioIODeviceCapabilitiesItf_>())).QuerySampleFormatsSupported
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioIODeviceCapabilitiesItf_),
            "::",
            stringify!(QuerySampleFormatsSupported)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLLEDDescriptor_ {
    pub ledCount: SLuint8,
    pub primaryLED: SLuint8,
    pub colorMask: SLuint32,
}
#[test]
fn bindgen_test_layout_SLLEDDescriptor_() {
    assert_eq!(
        ::std::mem::size_of::<SLLEDDescriptor_>(),
        8usize,
        concat!("Size of: ", stringify!(SLLEDDescriptor_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLLEDDescriptor_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLLEDDescriptor_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDDescriptor_>())).ledCount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDDescriptor_),
            "::",
            stringify!(ledCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDDescriptor_>())).primaryLED as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDDescriptor_),
            "::",
            stringify!(primaryLED)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDDescriptor_>())).colorMask as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDDescriptor_),
            "::",
            stringify!(colorMask)
        )
    );
}
pub type SLLEDDescriptor = SLLEDDescriptor_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLHSL_ {
    pub hue: SLmillidegree,
    pub saturation: SLpermille,
    pub lightness: SLpermille,
}
#[test]
fn bindgen_test_layout_SLHSL_() {
    assert_eq!(
        ::std::mem::size_of::<SLHSL_>(),
        8usize,
        concat!("Size of: ", stringify!(SLHSL_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLHSL_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLHSL_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLHSL_>())).hue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLHSL_),
            "::",
            stringify!(hue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLHSL_>())).saturation as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLHSL_),
            "::",
            stringify!(saturation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLHSL_>())).lightness as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SLHSL_),
            "::",
            stringify!(lightness)
        )
    );
}
pub type SLHSL = SLHSL_;
extern "C" {
    pub static SL_IID_LED: SLInterfaceID;
}
pub type SLLEDArrayItf = *const *const SLLEDArrayItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLLEDArrayItf_ {
    pub ActivateLEDArray: ::std::option::Option<
        unsafe extern "C" fn(self_: SLLEDArrayItf, lightMask: SLuint32) -> SLresult,
    >,
    pub IsLEDArrayActivated: ::std::option::Option<
        unsafe extern "C" fn(self_: SLLEDArrayItf, lightMask: *mut SLuint32) -> SLresult,
    >,
    pub SetColor: ::std::option::Option<
        unsafe extern "C" fn(self_: SLLEDArrayItf, index: SLuint8, color: *const SLHSL) -> SLresult,
    >,
    pub GetColor: ::std::option::Option<
        unsafe extern "C" fn(self_: SLLEDArrayItf, index: SLuint8, color: *mut SLHSL) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLLEDArrayItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLLEDArrayItf_>(),
        32usize,
        concat!("Size of: ", stringify!(SLLEDArrayItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLLEDArrayItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLLEDArrayItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDArrayItf_>())).ActivateLEDArray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDArrayItf_),
            "::",
            stringify!(ActivateLEDArray)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLLEDArrayItf_>())).IsLEDArrayActivated as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDArrayItf_),
            "::",
            stringify!(IsLEDArrayActivated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDArrayItf_>())).SetColor as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDArrayItf_),
            "::",
            stringify!(SetColor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLLEDArrayItf_>())).GetColor as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLLEDArrayItf_),
            "::",
            stringify!(GetColor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVibraDescriptor_ {
    pub supportsFrequency: SLboolean,
    pub supportsIntensity: SLboolean,
    pub minFrequency: SLmilliHertz,
    pub maxFrequency: SLmilliHertz,
}
#[test]
fn bindgen_test_layout_SLVibraDescriptor_() {
    assert_eq!(
        ::std::mem::size_of::<SLVibraDescriptor_>(),
        16usize,
        concat!("Size of: ", stringify!(SLVibraDescriptor_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVibraDescriptor_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLVibraDescriptor_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVibraDescriptor_>())).supportsFrequency as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraDescriptor_),
            "::",
            stringify!(supportsFrequency)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVibraDescriptor_>())).supportsIntensity as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraDescriptor_),
            "::",
            stringify!(supportsIntensity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraDescriptor_>())).minFrequency as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraDescriptor_),
            "::",
            stringify!(minFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraDescriptor_>())).maxFrequency as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraDescriptor_),
            "::",
            stringify!(maxFrequency)
        )
    );
}
pub type SLVibraDescriptor = SLVibraDescriptor_;
extern "C" {
    pub static SL_IID_VIBRA: SLInterfaceID;
}
pub type SLVibraItf = *const *const SLVibraItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVibraItf_ {
    pub Vibrate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, vibrate: SLboolean) -> SLresult,
    >,
    pub IsVibrating: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, pVibrating: *mut SLboolean) -> SLresult,
    >,
    pub SetFrequency: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, frequency: SLmilliHertz) -> SLresult,
    >,
    pub GetFrequency: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, pFrequency: *mut SLmilliHertz) -> SLresult,
    >,
    pub SetIntensity: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, intensity: SLpermille) -> SLresult,
    >,
    pub GetIntensity: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVibraItf, pIntensity: *mut SLpermille) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLVibraItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLVibraItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLVibraItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVibraItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLVibraItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).Vibrate as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(Vibrate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).IsVibrating as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(IsVibrating)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).SetFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(SetFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).GetFrequency as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(GetFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).SetIntensity as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(SetIntensity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVibraItf_>())).GetIntensity as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVibraItf_),
            "::",
            stringify!(GetIntensity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMetadataInfo_ {
    pub size: SLuint32,
    pub encoding: SLuint32,
    pub langCountry: [SLchar; 16usize],
    pub data: [SLuint8; 1usize],
}
#[test]
fn bindgen_test_layout_SLMetadataInfo_() {
    assert_eq!(
        ::std::mem::size_of::<SLMetadataInfo_>(),
        28usize,
        concat!("Size of: ", stringify!(SLMetadataInfo_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMetadataInfo_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLMetadataInfo_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataInfo_>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataInfo_),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataInfo_>())).encoding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataInfo_),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataInfo_>())).langCountry as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataInfo_),
            "::",
            stringify!(langCountry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataInfo_>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataInfo_),
            "::",
            stringify!(data)
        )
    );
}
pub type SLMetadataInfo = SLMetadataInfo_;
extern "C" {
    pub static SL_IID_METADATAEXTRACTION: SLInterfaceID;
}
pub type SLMetadataExtractionItf = *const *const SLMetadataExtractionItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMetadataExtractionItf_ {
    pub GetItemCount: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMetadataExtractionItf, pItemCount: *mut SLuint32) -> SLresult,
    >,
    pub GetKeySize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataExtractionItf,
            index: SLuint32,
            pKeySize: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetKey: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataExtractionItf,
            index: SLuint32,
            keySize: SLuint32,
            pKey: *mut SLMetadataInfo,
        ) -> SLresult,
    >,
    pub GetValueSize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataExtractionItf,
            index: SLuint32,
            pValueSize: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetValue: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataExtractionItf,
            index: SLuint32,
            valueSize: SLuint32,
            pValue: *mut SLMetadataInfo,
        ) -> SLresult,
    >,
    pub AddKeyFilter: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataExtractionItf,
            keySize: SLuint32,
            pKey: *const ::std::os::raw::c_void,
            keyEncoding: SLuint32,
            pValueLangCountry: *const SLchar,
            valueEncoding: SLuint32,
            filterMask: SLuint8,
        ) -> SLresult,
    >,
    pub ClearKeyFilter:
        ::std::option::Option<unsafe extern "C" fn(self_: SLMetadataExtractionItf) -> SLresult>,
}
#[test]
fn bindgen_test_layout_SLMetadataExtractionItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMetadataExtractionItf_>(),
        56usize,
        concat!("Size of: ", stringify!(SLMetadataExtractionItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMetadataExtractionItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMetadataExtractionItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).GetItemCount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(GetItemCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).GetKeySize as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(GetKeySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).GetKey as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(GetKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).GetValueSize as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(GetValueSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).GetValue as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(GetValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).AddKeyFilter as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(AddKeyFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataExtractionItf_>())).ClearKeyFilter as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataExtractionItf_),
            "::",
            stringify!(ClearKeyFilter)
        )
    );
}
extern "C" {
    pub static SL_IID_METADATAMESSAGE: SLInterfaceID;
}
pub type SLMetadataMessageItf = *const *const SLMetadataMessageItf_;
pub type slMetadataCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLMetadataMessageItf,
        pContext: *mut ::std::os::raw::c_void,
        index: SLuint32,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMetadataMessageItf_ {
    pub RegisterMetadataCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataMessageItf,
            callback: slMetadataCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMetadataMessageItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMetadataMessageItf_>(),
        8usize,
        concat!("Size of: ", stringify!(SLMetadataMessageItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMetadataMessageItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMetadataMessageItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataMessageItf_>())).RegisterMetadataCallback as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataMessageItf_),
            "::",
            stringify!(RegisterMetadataCallback)
        )
    );
}
extern "C" {
    pub static SL_IID_METADATATRAVERSAL: SLInterfaceID;
}
pub type SLMetadataTraversalItf = *const *const SLMetadataTraversalItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMetadataTraversalItf_ {
    pub SetMode: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMetadataTraversalItf, mode: SLuint32) -> SLresult,
    >,
    pub GetChildCount: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMetadataTraversalItf, pCount: *mut SLuint32) -> SLresult,
    >,
    pub GetChildMIMETypeSize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataTraversalItf,
            index: SLuint32,
            pSize: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetChildInfo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMetadataTraversalItf,
            index: SLuint32,
            pNodeID: *mut SLint32,
            pType: *mut SLuint32,
            size: SLuint32,
            pMimeType: *mut SLchar,
        ) -> SLresult,
    >,
    pub SetActiveNode: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMetadataTraversalItf, index: SLuint32) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMetadataTraversalItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMetadataTraversalItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLMetadataTraversalItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMetadataTraversalItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMetadataTraversalItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMetadataTraversalItf_>())).SetMode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataTraversalItf_),
            "::",
            stringify!(SetMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataTraversalItf_>())).GetChildCount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataTraversalItf_),
            "::",
            stringify!(GetChildCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataTraversalItf_>())).GetChildMIMETypeSize as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataTraversalItf_),
            "::",
            stringify!(GetChildMIMETypeSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataTraversalItf_>())).GetChildInfo as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataTraversalItf_),
            "::",
            stringify!(GetChildInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMetadataTraversalItf_>())).SetActiveNode as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMetadataTraversalItf_),
            "::",
            stringify!(SetActiveNode)
        )
    );
}
extern "C" {
    pub static SL_IID_DYNAMICSOURCE: SLInterfaceID;
}
pub type SLDynamicSourceItf = *const *const SLDynamicSourceItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDynamicSourceItf_ {
    pub SetSource: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicSourceItf,
            pDataSource: *const SLDataSource,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLDynamicSourceItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLDynamicSourceItf_>(),
        8usize,
        concat!("Size of: ", stringify!(SLDynamicSourceItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDynamicSourceItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDynamicSourceItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDynamicSourceItf_>())).SetSource as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicSourceItf_),
            "::",
            stringify!(SetSource)
        )
    );
}
extern "C" {
    pub static SL_IID_DYNAMICSOURCESINKCHANGE: SLInterfaceID;
}
pub type SLDynamicSourceSinkChangeItf = *const *const SLDynamicSourceSinkChangeItf_;
pub type slSourceChangeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLDynamicSourceSinkChangeItf,
        pContext: *mut ::std::os::raw::c_void,
        resultCode: SLuint32,
        pExistingDataSource: *const SLDataSource,
        pNewDataSource: *const SLDataSource,
    ),
>;
pub type slSinkChangeCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLDynamicSourceSinkChangeItf,
        pContext: *mut ::std::os::raw::c_void,
        resultCode: SLuint32,
        pExistingDataSink: *const SLDataSource,
        pNewDataSink: *const SLDataSource,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDynamicSourceSinkChangeItf_ {
    pub ChangeSource: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicSourceSinkChangeItf,
            pExistingDataSource: *const SLDataSource,
            pNewDataSource: *const SLDataSource,
            async_: SLboolean,
        ) -> SLresult,
    >,
    pub ChangeSink: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicSourceSinkChangeItf,
            pExistingDataSink: *const SLDataSink,
            pNewDataSink: *const SLDataSink,
            async_: SLboolean,
        ) -> SLresult,
    >,
    pub RegisterSourceChangeCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicSourceSinkChangeItf,
            callback: slSourceChangeCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub RegisterSinkChangeCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicSourceSinkChangeItf,
            callback: slSinkChangeCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLDynamicSourceSinkChangeItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLDynamicSourceSinkChangeItf_>(),
        32usize,
        concat!("Size of: ", stringify!(SLDynamicSourceSinkChangeItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDynamicSourceSinkChangeItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDynamicSourceSinkChangeItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicSourceSinkChangeItf_>())).ChangeSource as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicSourceSinkChangeItf_),
            "::",
            stringify!(ChangeSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicSourceSinkChangeItf_>())).ChangeSink as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicSourceSinkChangeItf_),
            "::",
            stringify!(ChangeSink)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicSourceSinkChangeItf_>())).RegisterSourceChangeCallback
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicSourceSinkChangeItf_),
            "::",
            stringify!(RegisterSourceChangeCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicSourceSinkChangeItf_>())).RegisterSinkChangeCallback
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicSourceSinkChangeItf_),
            "::",
            stringify!(RegisterSinkChangeCallback)
        )
    );
}
extern "C" {
    pub static SL_IID_OUTPUTMIX: SLInterfaceID;
}
pub type SLOutputMixItf = *const *const SLOutputMixItf_;
pub type slMixDeviceChangeCallback = ::std::option::Option<
    unsafe extern "C" fn(caller: SLOutputMixItf, pContext: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLOutputMixItf_ {
    pub GetDestinationOutputDeviceIDs: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLOutputMixItf,
            pNumDevices: *mut SLint32,
            pDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
    pub RegisterDeviceChangeCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLOutputMixItf,
            callback: slMixDeviceChangeCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub ReRoute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLOutputMixItf,
            numOutputDevices: SLint32,
            pOutputDeviceIDs: *mut SLuint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLOutputMixItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLOutputMixItf_>(),
        24usize,
        concat!("Size of: ", stringify!(SLOutputMixItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLOutputMixItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLOutputMixItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLOutputMixItf_>())).GetDestinationOutputDeviceIDs as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLOutputMixItf_),
            "::",
            stringify!(GetDestinationOutputDeviceIDs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLOutputMixItf_>())).RegisterDeviceChangeCallback as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLOutputMixItf_),
            "::",
            stringify!(RegisterDeviceChangeCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLOutputMixItf_>())).ReRoute as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLOutputMixItf_),
            "::",
            stringify!(ReRoute)
        )
    );
}
extern "C" {
    pub static SL_IID_PLAY: SLInterfaceID;
}
pub type SLPlayItf = *const *const SLPlayItf_;
pub type slPlayCallback = ::std::option::Option<
    unsafe extern "C" fn(caller: SLPlayItf, pContext: *mut ::std::os::raw::c_void, event: SLuint32),
>;
#[doc = " Playback interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLPlayItf_ {
    pub SetPlayState:
        ::std::option::Option<unsafe extern "C" fn(self_: SLPlayItf, state: SLuint32) -> SLresult>,
    pub GetPlayState: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pState: *mut SLuint32) -> SLresult,
    >,
    pub GetDuration: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
    pub GetPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLPlayItf,
            callback: slPlayCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub SetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, eventFlags: SLuint32) -> SLresult,
    >,
    pub GetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pEventFlags: *mut SLuint32) -> SLresult,
    >,
    pub SetMarkerPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, mSec: SLmillisecond) -> SLresult,
    >,
    pub ClearMarkerPosition:
        ::std::option::Option<unsafe extern "C" fn(self_: SLPlayItf) -> SLresult>,
    pub GetMarkerPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
    pub SetPositionUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, mSec: SLmillisecond) -> SLresult,
    >,
    pub GetPositionUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlayItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLPlayItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLPlayItf_>(),
        96usize,
        concat!("Size of: ", stringify!(SLPlayItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLPlayItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLPlayItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).SetPlayState as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(SetPlayState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).GetPlayState as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetPlayState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).GetDuration as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetDuration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).GetPosition as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).RegisterCallback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlayItf_>())).SetCallbackEventsMask as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(SetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlayItf_>())).GetCallbackEventsMask as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).SetMarkerPosition as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(SetMarkerPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).ClearMarkerPosition as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(ClearMarkerPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlayItf_>())).GetMarkerPosition as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetMarkerPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlayItf_>())).SetPositionUpdatePeriod as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(SetPositionUpdatePeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlayItf_>())).GetPositionUpdatePeriod as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlayItf_),
            "::",
            stringify!(GetPositionUpdatePeriod)
        )
    );
}
extern "C" {
    pub static SL_IID_PREFETCHSTATUS: SLInterfaceID;
}
pub type SLPrefetchStatusItf = *const *const SLPrefetchStatusItf_;
pub type slPrefetchCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLPrefetchStatusItf,
        pContext: *mut ::std::os::raw::c_void,
        event: SLuint32,
    ),
>;
#[doc = " Prefetch status interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLPrefetchStatusItf_ {
    pub GetPrefetchStatus: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, pStatus: *mut SLuint32) -> SLresult,
    >,
    pub GetFillLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, pLevel: *mut SLpermille) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLPrefetchStatusItf,
            callback: slPrefetchCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub SetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, eventFlags: SLuint32) -> SLresult,
    >,
    pub GetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, pEventFlags: *mut SLuint32) -> SLresult,
    >,
    pub SetFillUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, period: SLpermille) -> SLresult,
    >,
    pub GetFillUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, pPeriod: *mut SLpermille) -> SLresult,
    >,
    pub GetError: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPrefetchStatusItf, pResult: *mut SLresult) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLPrefetchStatusItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLPrefetchStatusItf_>(),
        64usize,
        concat!("Size of: ", stringify!(SLPrefetchStatusItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLPrefetchStatusItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLPrefetchStatusItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).GetPrefetchStatus as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(GetPrefetchStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).GetFillLevel as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(GetFillLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).RegisterCallback as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).SetCallbackEventsMask as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(SetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).GetCallbackEventsMask as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(GetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).SetFillUpdatePeriod as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(SetFillUpdatePeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).GetFillUpdatePeriod as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(GetFillUpdatePeriod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPrefetchStatusItf_>())).GetError as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPrefetchStatusItf_),
            "::",
            stringify!(GetError)
        )
    );
}
extern "C" {
    pub static SL_IID_PLAYBACKRATE: SLInterfaceID;
}
pub type SLPlaybackRateItf = *const *const SLPlaybackRateItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLPlaybackRateItf_ {
    pub SetRate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlaybackRateItf, rate: SLpermille) -> SLresult,
    >,
    pub GetRate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlaybackRateItf, pRate: *mut SLpermille) -> SLresult,
    >,
    pub SetPropertyConstraints: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlaybackRateItf, constraints: SLuint32) -> SLresult,
    >,
    pub GetProperties: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPlaybackRateItf, pProperties: *mut SLuint32) -> SLresult,
    >,
    pub GetCapabilitiesOfRate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLPlaybackRateItf,
            rate: SLpermille,
            pCapabilities: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetRateRange: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLPlaybackRateItf,
            index: SLuint8,
            pMinRate: *mut SLpermille,
            pMaxRate: *mut SLpermille,
            pStepSize: *mut SLpermille,
            pCapabilities: *mut SLuint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLPlaybackRateItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLPlaybackRateItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLPlaybackRateItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLPlaybackRateItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLPlaybackRateItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlaybackRateItf_>())).SetRate as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(SetRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlaybackRateItf_>())).GetRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(GetRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlaybackRateItf_>())).SetPropertyConstraints as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(SetPropertyConstraints)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlaybackRateItf_>())).GetProperties as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(GetProperties)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPlaybackRateItf_>())).GetCapabilitiesOfRate as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(GetCapabilitiesOfRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPlaybackRateItf_>())).GetRateRange as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPlaybackRateItf_),
            "::",
            stringify!(GetRateRange)
        )
    );
}
extern "C" {
    pub static SL_IID_SEEK: SLInterfaceID;
}
pub type SLSeekItf = *const *const SLSeekItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLSeekItf_ {
    pub SetPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLSeekItf, pos: SLmillisecond, seekMode: SLuint32) -> SLresult,
    >,
    pub SetLoop: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLSeekItf,
            loopEnable: SLboolean,
            startPos: SLmillisecond,
            endPos: SLmillisecond,
        ) -> SLresult,
    >,
    pub GetLoop: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLSeekItf,
            pLoopEnabled: *mut SLboolean,
            pStartPos: *mut SLmillisecond,
            pEndPos: *mut SLmillisecond,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLSeekItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLSeekItf_>(),
        24usize,
        concat!("Size of: ", stringify!(SLSeekItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLSeekItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLSeekItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLSeekItf_>())).SetPosition as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLSeekItf_),
            "::",
            stringify!(SetPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLSeekItf_>())).SetLoop as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLSeekItf_),
            "::",
            stringify!(SetLoop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLSeekItf_>())).GetLoop as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLSeekItf_),
            "::",
            stringify!(GetLoop)
        )
    );
}
extern "C" {
    pub static SL_IID_RECORD: SLInterfaceID;
}
pub type SLRecordItf = *const *const SLRecordItf_;
pub type slRecordCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLRecordItf,
        pContext: *mut ::std::os::raw::c_void,
        event: SLuint32,
    ),
>;
#[doc = " Recording interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLRecordItf_ {
    pub SetRecordState: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, state: SLuint32) -> SLresult,
    >,
    pub GetRecordState: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, pState: *mut SLuint32) -> SLresult,
    >,
    pub SetDurationLimit: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, msec: SLmillisecond) -> SLresult,
    >,
    pub GetPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLRecordItf,
            callback: slRecordCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub SetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, eventFlags: SLuint32) -> SLresult,
    >,
    pub GetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, pEventFlags: *mut SLuint32) -> SLresult,
    >,
    pub SetMarkerPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, mSec: SLmillisecond) -> SLresult,
    >,
    pub ClearMarkerPosition:
        ::std::option::Option<unsafe extern "C" fn(self_: SLRecordItf) -> SLresult>,
    pub GetMarkerPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
    pub SetPositionUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, mSec: SLmillisecond) -> SLresult,
    >,
    pub GetPositionUpdatePeriod: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRecordItf, pMsec: *mut SLmillisecond) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLRecordItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLRecordItf_>(),
        96usize,
        concat!("Size of: ", stringify!(SLRecordItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLRecordItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLRecordItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).SetRecordState as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(SetRecordState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).GetRecordState as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(GetRecordState)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).SetDurationLimit as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(SetDurationLimit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).GetPosition as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(GetPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).RegisterCallback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRecordItf_>())).SetCallbackEventsMask as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(SetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRecordItf_>())).GetCallbackEventsMask as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(GetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).SetMarkerPosition as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(SetMarkerPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRecordItf_>())).ClearMarkerPosition as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(ClearMarkerPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRecordItf_>())).GetMarkerPosition as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(GetMarkerPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRecordItf_>())).SetPositionUpdatePeriod as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(SetPositionUpdatePeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRecordItf_>())).GetPositionUpdatePeriod as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRecordItf_),
            "::",
            stringify!(GetPositionUpdatePeriod)
        )
    );
}
extern "C" {
    pub static SL_IID_EQUALIZER: SLInterfaceID;
}
pub type SLEqualizerItf = *const *const SLEqualizerItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEqualizerItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, enabled: SLboolean) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, pEnabled: *mut SLboolean) -> SLresult,
    >,
    pub GetNumberOfBands: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, pAmount: *mut SLuint16) -> SLresult,
    >,
    pub GetBandLevelRange: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            pMin: *mut SLmillibel,
            pMax: *mut SLmillibel,
        ) -> SLresult,
    >,
    pub SetBandLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, band: SLuint16, level: SLmillibel) -> SLresult,
    >,
    pub GetBandLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            band: SLuint16,
            pLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
    pub GetCenterFreq: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            band: SLuint16,
            pCenter: *mut SLmilliHertz,
        ) -> SLresult,
    >,
    pub GetBandFreqRange: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            band: SLuint16,
            pMin: *mut SLmilliHertz,
            pMax: *mut SLmilliHertz,
        ) -> SLresult,
    >,
    pub GetBand: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            frequency: SLmilliHertz,
            pBand: *mut SLuint16,
        ) -> SLresult,
    >,
    pub GetCurrentPreset: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, pPreset: *mut SLuint16) -> SLresult,
    >,
    pub UsePreset: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, index: SLuint16) -> SLresult,
    >,
    pub GetNumberOfPresets: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEqualizerItf, pNumPresets: *mut SLuint16) -> SLresult,
    >,
    pub GetPresetName: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEqualizerItf,
            index: SLuint16,
            pSize: *mut SLuint16,
            pName: *mut SLchar,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLEqualizerItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLEqualizerItf_>(),
        104usize,
        concat!("Size of: ", stringify!(SLEqualizerItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEqualizerItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLEqualizerItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).SetEnabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).IsEnabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEqualizerItf_>())).GetNumberOfBands as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetNumberOfBands)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEqualizerItf_>())).GetBandLevelRange as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetBandLevelRange)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).SetBandLevel as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(SetBandLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).GetBandLevel as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetBandLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).GetCenterFreq as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetCenterFreq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEqualizerItf_>())).GetBandFreqRange as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetBandFreqRange)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).GetBand as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetBand)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEqualizerItf_>())).GetCurrentPreset as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetCurrentPreset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).UsePreset as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(UsePreset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEqualizerItf_>())).GetNumberOfPresets as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetNumberOfPresets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEqualizerItf_>())).GetPresetName as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEqualizerItf_),
            "::",
            stringify!(GetPresetName)
        )
    );
}
extern "C" {
    pub static SL_IID_VOLUME: SLInterfaceID;
}
pub type SLVolumeItf = *const *const SLVolumeItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVolumeItf_ {
    pub SetVolumeLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, level: SLmillibel) -> SLresult,
    >,
    pub GetVolumeLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, pLevel: *mut SLmillibel) -> SLresult,
    >,
    pub GetMaxVolumeLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, pMaxLevel: *mut SLmillibel) -> SLresult,
    >,
    pub SetMute: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, mute: SLboolean) -> SLresult,
    >,
    pub GetMute: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, pMute: *mut SLboolean) -> SLresult,
    >,
    pub EnableStereoPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, enable: SLboolean) -> SLresult,
    >,
    pub IsEnabledStereoPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, pEnable: *mut SLboolean) -> SLresult,
    >,
    pub SetStereoPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, stereoPosition: SLpermille) -> SLresult,
    >,
    pub GetStereoPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVolumeItf, pStereoPosition: *mut SLpermille) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLVolumeItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLVolumeItf_>(),
        72usize,
        concat!("Size of: ", stringify!(SLVolumeItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVolumeItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLVolumeItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).SetVolumeLevel as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(SetVolumeLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).GetVolumeLevel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(GetVolumeLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).GetMaxVolumeLevel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(GetMaxVolumeLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).SetMute as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(SetMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).GetMute as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(GetMute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVolumeItf_>())).EnableStereoPosition as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(EnableStereoPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVolumeItf_>())).IsEnabledStereoPosition as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(IsEnabledStereoPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).SetStereoPosition as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(SetStereoPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVolumeItf_>())).GetStereoPosition as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVolumeItf_),
            "::",
            stringify!(GetStereoPosition)
        )
    );
}
extern "C" {
    pub static SL_IID_DEVICEVOLUME: SLInterfaceID;
}
pub type SLDeviceVolumeItf = *const *const SLDeviceVolumeItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDeviceVolumeItf_ {
    pub GetVolumeScale: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDeviceVolumeItf,
            deviceID: SLuint32,
            pMinValue: *mut SLint32,
            pMaxValue: *mut SLint32,
            pIsMillibelScale: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetVolume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDeviceVolumeItf,
            deviceID: SLuint32,
            volume: SLint32,
        ) -> SLresult,
    >,
    pub GetVolume: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDeviceVolumeItf,
            deviceID: SLuint32,
            pVolume: *mut SLint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLDeviceVolumeItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLDeviceVolumeItf_>(),
        24usize,
        concat!("Size of: ", stringify!(SLDeviceVolumeItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDeviceVolumeItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLDeviceVolumeItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDeviceVolumeItf_>())).GetVolumeScale as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDeviceVolumeItf_),
            "::",
            stringify!(GetVolumeScale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDeviceVolumeItf_>())).SetVolume as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDeviceVolumeItf_),
            "::",
            stringify!(SetVolume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLDeviceVolumeItf_>())).GetVolume as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDeviceVolumeItf_),
            "::",
            stringify!(GetVolume)
        )
    );
}
extern "C" {
    pub static SL_IID_BUFFERQUEUE: SLInterfaceID;
}
pub type SLBufferQueueItf = *const *const SLBufferQueueItf_;
pub type slBufferQueueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLBufferQueueItf,
        eventFlags: SLuint32,
        pBuffer: *const ::std::os::raw::c_void,
        bufferSize: SLuint32,
        dataUsed: SLuint32,
        pContext: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " Buffer queue state"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLBufferQueueState_ {
    pub count: SLuint32,
    pub index: SLuint32,
}
#[test]
fn bindgen_test_layout_SLBufferQueueState_() {
    assert_eq!(
        ::std::mem::size_of::<SLBufferQueueState_>(),
        8usize,
        concat!("Size of: ", stringify!(SLBufferQueueState_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLBufferQueueState_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLBufferQueueState_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBufferQueueState_>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueState_),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBufferQueueState_>())).index as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueState_),
            "::",
            stringify!(index)
        )
    );
}
pub type SLBufferQueueState = SLBufferQueueState_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLBufferQueueItf_ {
    pub Enqueue: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLBufferQueueItf,
            pBuffer: *const ::std::os::raw::c_void,
            size: SLuint32,
            isLastBuffer: SLboolean,
        ) -> SLresult,
    >,
    pub Clear: ::std::option::Option<unsafe extern "C" fn(self_: SLBufferQueueItf) -> SLresult>,
    pub GetState: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBufferQueueItf, pState: *mut SLBufferQueueState) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLBufferQueueItf,
            callback: slBufferQueueCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub SetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBufferQueueItf, eventFlags: SLuint32) -> SLresult,
    >,
    pub GetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBufferQueueItf, pEventFlags: *mut SLuint32) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLBufferQueueItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLBufferQueueItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLBufferQueueItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLBufferQueueItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLBufferQueueItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBufferQueueItf_>())).Enqueue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(Enqueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBufferQueueItf_>())).Clear as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(Clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBufferQueueItf_>())).GetState as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(GetState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLBufferQueueItf_>())).RegisterCallback as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLBufferQueueItf_>())).SetCallbackEventsMask as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(SetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLBufferQueueItf_>())).GetCallbackEventsMask as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBufferQueueItf_),
            "::",
            stringify!(GetCallbackEventsMask)
        )
    );
}
extern "C" {
    pub static SL_IID_CONFIGEXTENSION: SLInterfaceID;
}
pub type SLConfigExtensionsItf = *const *const SLConfigExtensionsItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLConfigExtensionsItf_ {
    pub SetConfiguration: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLConfigExtensionsItf,
            pConfigKey: *const SLchar,
            valueSize: SLuint32,
            pConfigValue: *const ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub GetConfiguration: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLConfigExtensionsItf,
            pConfigKey: *const SLchar,
            pValueSize: *mut SLuint32,
            pConfigValue: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLConfigExtensionsItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLConfigExtensionsItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLConfigExtensionsItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLConfigExtensionsItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLConfigExtensionsItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLConfigExtensionsItf_>())).SetConfiguration as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLConfigExtensionsItf_),
            "::",
            stringify!(SetConfiguration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLConfigExtensionsItf_>())).GetConfiguration as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLConfigExtensionsItf_),
            "::",
            stringify!(GetConfiguration)
        )
    );
}
extern "C" {
    pub static SL_IID_PRESETREVERB: SLInterfaceID;
}
pub type SLPresetReverbItf = *const *const SLPresetReverbItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLPresetReverbItf_ {
    pub SetPreset: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPresetReverbItf, preset: SLuint16) -> SLresult,
    >,
    pub GetPreset: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPresetReverbItf, pPreset: *mut SLuint16) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLPresetReverbItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLPresetReverbItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLPresetReverbItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLPresetReverbItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLPresetReverbItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPresetReverbItf_>())).SetPreset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPresetReverbItf_),
            "::",
            stringify!(SetPreset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPresetReverbItf_>())).GetPreset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPresetReverbItf_),
            "::",
            stringify!(GetPreset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEnvironmentalReverbSettings_ {
    pub roomLevel: SLmillibel,
    pub roomHFLevel: SLmillibel,
    pub decayTime: SLmillisecond,
    pub decayHFRatio: SLpermille,
    pub reflectionsLevel: SLmillibel,
    pub reflectionsDelay: SLmillisecond,
    pub reverbLevel: SLmillibel,
    pub reverbDelay: SLmillisecond,
    pub diffusion: SLpermille,
    pub density: SLpermille,
}
#[test]
fn bindgen_test_layout_SLEnvironmentalReverbSettings_() {
    assert_eq!(
        ::std::mem::size_of::<SLEnvironmentalReverbSettings_>(),
        28usize,
        concat!("Size of: ", stringify!(SLEnvironmentalReverbSettings_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEnvironmentalReverbSettings_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLEnvironmentalReverbSettings_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).roomLevel as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(roomLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).roomHFLevel as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(roomHFLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).decayTime as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(decayTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).decayHFRatio as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(decayHFRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).reflectionsLevel as *const _
                as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(reflectionsLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).reflectionsDelay as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(reflectionsDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).reverbLevel as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(reverbLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).reverbDelay as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(reverbDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).diffusion as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(diffusion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbSettings_>())).density as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbSettings_),
            "::",
            stringify!(density)
        )
    );
}
pub type SLEnvironmentalReverbSettings = SLEnvironmentalReverbSettings_;
extern "C" {
    pub static SL_IID_ENVIRONMENTALREVERB: SLInterfaceID;
}
pub type SLEnvironmentalReverbItf = *const *const SLEnvironmentalReverbItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEnvironmentalReverbItf_ {
    pub SetRoomLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, room: SLmillibel) -> SLresult,
    >,
    pub GetRoomLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, pRoom: *mut SLmillibel) -> SLresult,
    >,
    pub SetRoomHFLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, roomHF: SLmillibel) -> SLresult,
    >,
    pub GetRoomHFLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, pRoomHF: *mut SLmillibel) -> SLresult,
    >,
    pub SetDecayTime: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, decayTime: SLmillisecond) -> SLresult,
    >,
    pub GetDecayTime: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pDecayTime: *mut SLmillisecond,
        ) -> SLresult,
    >,
    pub SetDecayHFRatio: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, decayHFRatio: SLpermille) -> SLresult,
    >,
    pub GetDecayHFRatio: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pDecayHFRatio: *mut SLpermille,
        ) -> SLresult,
    >,
    pub SetReflectionsLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            reflectionsLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub GetReflectionsLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pReflectionsLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
    pub SetReflectionsDelay: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            reflectionsDelay: SLmillisecond,
        ) -> SLresult,
    >,
    pub GetReflectionsDelay: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pReflectionsDelay: *mut SLmillisecond,
        ) -> SLresult,
    >,
    pub SetReverbLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, reverbLevel: SLmillibel) -> SLresult,
    >,
    pub GetReverbLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pReverbLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
    pub SetReverbDelay: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            reverbDelay: SLmillisecond,
        ) -> SLresult,
    >,
    pub GetReverbDelay: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pReverbDelay: *mut SLmillisecond,
        ) -> SLresult,
    >,
    pub SetDiffusion: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, diffusion: SLpermille) -> SLresult,
    >,
    pub GetDiffusion: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pDiffusion: *mut SLpermille,
        ) -> SLresult,
    >,
    pub SetDensity: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEnvironmentalReverbItf, density: SLpermille) -> SLresult,
    >,
    pub GetDensity: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pDensity: *mut SLpermille,
        ) -> SLresult,
    >,
    pub SetEnvironmentalReverbProperties: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pProperties: *const SLEnvironmentalReverbSettings,
        ) -> SLresult,
    >,
    pub GetEnvironmentalReverbProperties: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEnvironmentalReverbItf,
            pProperties: *mut SLEnvironmentalReverbSettings,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLEnvironmentalReverbItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLEnvironmentalReverbItf_>(),
        176usize,
        concat!("Size of: ", stringify!(SLEnvironmentalReverbItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEnvironmentalReverbItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLEnvironmentalReverbItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetRoomLevel as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetRoomLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetRoomLevel as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetRoomLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetRoomHFLevel as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetRoomHFLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetRoomHFLevel as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetRoomHFLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetDecayTime as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetDecayTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetDecayTime as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetDecayTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetDecayHFRatio as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetDecayHFRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetDecayHFRatio as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetDecayHFRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetReflectionsLevel as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetReflectionsLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetReflectionsLevel as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetReflectionsLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetReflectionsDelay as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetReflectionsDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetReflectionsDelay as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetReflectionsDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetReverbLevel as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetReverbLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetReverbLevel as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetReverbLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetReverbDelay as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetReverbDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetReverbDelay as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetReverbDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetDiffusion as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetDiffusion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetDiffusion as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetDiffusion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetDensity as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetDensity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetDensity as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetDensity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).SetEnvironmentalReverbProperties
                as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(SetEnvironmentalReverbProperties)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEnvironmentalReverbItf_>())).GetEnvironmentalReverbProperties
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEnvironmentalReverbItf_),
            "::",
            stringify!(GetEnvironmentalReverbProperties)
        )
    );
}
extern "C" {
    pub static SL_IID_EFFECTSEND: SLInterfaceID;
}
pub type SLEffectSendItf = *const *const SLEffectSendItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEffectSendItf_ {
    pub EnableEffectSend: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEffectSendItf,
            pAuxEffect: *const ::std::os::raw::c_void,
            enable: SLboolean,
            initialLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEffectSendItf,
            pAuxEffect: *const ::std::os::raw::c_void,
            pEnable: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetDirectLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEffectSendItf, directLevel: SLmillibel) -> SLresult,
    >,
    pub GetDirectLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEffectSendItf, pDirectLevel: *mut SLmillibel) -> SLresult,
    >,
    pub SetSendLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEffectSendItf,
            pAuxEffect: *const ::std::os::raw::c_void,
            sendLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub GetSendLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEffectSendItf,
            pAuxEffect: *const ::std::os::raw::c_void,
            pSendLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLEffectSendItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLEffectSendItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLEffectSendItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEffectSendItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLEffectSendItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEffectSendItf_>())).EnableEffectSend as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(EnableEffectSend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEffectSendItf_>())).IsEnabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEffectSendItf_>())).SetDirectLevel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(SetDirectLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEffectSendItf_>())).GetDirectLevel as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(GetDirectLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEffectSendItf_>())).SetSendLevel as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(SetSendLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEffectSendItf_>())).GetSendLevel as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEffectSendItf_),
            "::",
            stringify!(GetSendLevel)
        )
    );
}
extern "C" {
    pub static SL_IID_3DGROUPING: SLInterfaceID;
}
pub type SL3DGroupingItf = *const *const SL3DGroupingItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DGroupingItf_ {
    pub Set3DGroup: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DGroupingItf, group: SLObjectItf) -> SLresult,
    >,
    pub Get3DGroup: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DGroupingItf, pGroup: *mut SLObjectItf) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DGroupingItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DGroupingItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SL3DGroupingItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DGroupingItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DGroupingItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DGroupingItf_>())).Set3DGroup as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DGroupingItf_),
            "::",
            stringify!(Set3DGroup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DGroupingItf_>())).Get3DGroup as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DGroupingItf_),
            "::",
            stringify!(Get3DGroup)
        )
    );
}
extern "C" {
    pub static SL_IID_3DHINT: SLInterfaceID;
}
pub type SL3DHintItf = *const *const SL3DHintItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DHintItf_ {
    pub SetRenderHint: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DHintItf, qualityHint: SLuint16) -> SLresult,
    >,
    pub GetRenderHint: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DHintItf, pQualityHint: *mut SLuint16) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DHintItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DHintItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SL3DHintItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DHintItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DHintItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DHintItf_>())).SetRenderHint as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DHintItf_),
            "::",
            stringify!(SetRenderHint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DHintItf_>())).GetRenderHint as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DHintItf_),
            "::",
            stringify!(GetRenderHint)
        )
    );
}
extern "C" {
    pub static SL_IID_3DCOMMIT: SLInterfaceID;
}
pub type SL3DCommitItf = *const *const SL3DCommitItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DCommitItf_ {
    pub Commit: ::std::option::Option<unsafe extern "C" fn(self_: SL3DCommitItf) -> SLresult>,
    pub SetDeferred: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DCommitItf, deferred: SLboolean) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DCommitItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DCommitItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SL3DCommitItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DCommitItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DCommitItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DCommitItf_>())).Commit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DCommitItf_),
            "::",
            stringify!(Commit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DCommitItf_>())).SetDeferred as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DCommitItf_),
            "::",
            stringify!(SetDeferred)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVec3D_ {
    pub x: SLint32,
    pub y: SLint32,
    pub z: SLint32,
}
#[test]
fn bindgen_test_layout_SLVec3D_() {
    assert_eq!(
        ::std::mem::size_of::<SLVec3D_>(),
        12usize,
        concat!("Size of: ", stringify!(SLVec3D_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVec3D_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLVec3D_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVec3D_>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVec3D_),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVec3D_>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVec3D_),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVec3D_>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVec3D_),
            "::",
            stringify!(z)
        )
    );
}
pub type SLVec3D = SLVec3D_;
extern "C" {
    pub static SL_IID_3DLOCATION: SLInterfaceID;
}
pub type SL3DLocationItf = *const *const SL3DLocationItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DLocationItf_ {
    pub SetLocationCartesian: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DLocationItf, pLocation: *const SLVec3D) -> SLresult,
    >,
    pub SetLocationSpherical: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DLocationItf,
            azimuth: SLmillidegree,
            elevation: SLmillidegree,
            distance: SLmillimeter,
        ) -> SLresult,
    >,
    pub Move: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DLocationItf, pMovement: *const SLVec3D) -> SLresult,
    >,
    pub GetLocationCartesian: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DLocationItf, pLocation: *mut SLVec3D) -> SLresult,
    >,
    pub SetOrientationVectors: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DLocationItf,
            pFront: *const SLVec3D,
            pAbove: *const SLVec3D,
        ) -> SLresult,
    >,
    pub SetOrientationAngles: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DLocationItf,
            heading: SLmillidegree,
            pitch: SLmillidegree,
            roll: SLmillidegree,
        ) -> SLresult,
    >,
    pub Rotate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DLocationItf,
            theta: SLmillidegree,
            pAxis: *const SLVec3D,
        ) -> SLresult,
    >,
    pub GetOrientationVectors: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DLocationItf,
            pFront: *mut SLVec3D,
            pUp: *mut SLVec3D,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DLocationItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DLocationItf_>(),
        64usize,
        concat!("Size of: ", stringify!(SL3DLocationItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DLocationItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DLocationItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).SetLocationCartesian as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(SetLocationCartesian)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).SetLocationSpherical as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(SetLocationSpherical)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DLocationItf_>())).Move as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(Move)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).GetLocationCartesian as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(GetLocationCartesian)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).SetOrientationVectors as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(SetOrientationVectors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).SetOrientationAngles as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(SetOrientationAngles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DLocationItf_>())).Rotate as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(Rotate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DLocationItf_>())).GetOrientationVectors as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DLocationItf_),
            "::",
            stringify!(GetOrientationVectors)
        )
    );
}
extern "C" {
    pub static SL_IID_3DDOPPLER: SLInterfaceID;
}
pub type SL3DDopplerItf = *const *const SL3DDopplerItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DDopplerItf_ {
    pub SetVelocityCartesian: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DDopplerItf, pVelocity: *const SLVec3D) -> SLresult,
    >,
    pub SetVelocitySpherical: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DDopplerItf,
            azimuth: SLmillidegree,
            elevation: SLmillidegree,
            speed: SLmillimeter,
        ) -> SLresult,
    >,
    pub GetVelocityCartesian: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DDopplerItf, pVelocity: *mut SLVec3D) -> SLresult,
    >,
    pub SetDopplerFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DDopplerItf, dopplerFactor: SLpermille) -> SLresult,
    >,
    pub GetDopplerFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DDopplerItf, pDopplerFactor: *mut SLpermille) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DDopplerItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DDopplerItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SL3DDopplerItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DDopplerItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DDopplerItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DDopplerItf_>())).SetVelocityCartesian as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DDopplerItf_),
            "::",
            stringify!(SetVelocityCartesian)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DDopplerItf_>())).SetVelocitySpherical as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DDopplerItf_),
            "::",
            stringify!(SetVelocitySpherical)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DDopplerItf_>())).GetVelocityCartesian as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DDopplerItf_),
            "::",
            stringify!(GetVelocityCartesian)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DDopplerItf_>())).SetDopplerFactor as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DDopplerItf_),
            "::",
            stringify!(SetDopplerFactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DDopplerItf_>())).GetDopplerFactor as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DDopplerItf_),
            "::",
            stringify!(GetDopplerFactor)
        )
    );
}
extern "C" {
    pub static SL_IID_3DSOURCE: SLInterfaceID;
}
pub type SL3DSourceItf = *const *const SL3DSourceItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DSourceItf_ {
    pub SetHeadRelative: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, headRelative: SLboolean) -> SLresult,
    >,
    pub GetHeadRelative: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, pHeadRelative: *mut SLboolean) -> SLresult,
    >,
    pub SetRolloffDistances: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DSourceItf,
            minDistance: SLmillimeter,
            maxDistance: SLmillimeter,
        ) -> SLresult,
    >,
    pub GetRolloffDistances: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DSourceItf,
            pMinDistance: *mut SLmillimeter,
            pMaxDistance: *mut SLmillimeter,
        ) -> SLresult,
    >,
    pub SetRolloffMaxDistanceMute: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, mute: SLboolean) -> SLresult,
    >,
    pub GetRolloffMaxDistanceMute: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, pMute: *mut SLboolean) -> SLresult,
    >,
    pub SetRolloffFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, rolloffFactor: SLpermille) -> SLresult,
    >,
    pub GetRolloffFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, pRolloffFactor: *mut SLpermille) -> SLresult,
    >,
    pub SetRoomRolloffFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, roomRolloffFactor: SLpermille) -> SLresult,
    >,
    pub GetRoomRolloffFactor: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, pRoomRolloffFactor: *mut SLpermille) -> SLresult,
    >,
    pub SetRolloffModel: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, model: SLuint8) -> SLresult,
    >,
    pub GetRolloffModel: ::std::option::Option<
        unsafe extern "C" fn(self_: SL3DSourceItf, pModel: *mut SLuint8) -> SLresult,
    >,
    pub SetCone: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DSourceItf,
            innerAngle: SLmillidegree,
            outerAngle: SLmillidegree,
            outerLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub GetCone: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DSourceItf,
            pInnerAngle: *mut SLmillidegree,
            pOuterAngle: *mut SLmillidegree,
            pOuterLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DSourceItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DSourceItf_>(),
        112usize,
        concat!("Size of: ", stringify!(SL3DSourceItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DSourceItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DSourceItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).SetHeadRelative as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetHeadRelative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).GetHeadRelative as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetHeadRelative)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).SetRolloffDistances as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetRolloffDistances)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).GetRolloffDistances as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetRolloffDistances)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).SetRolloffMaxDistanceMute as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetRolloffMaxDistanceMute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).GetRolloffMaxDistanceMute as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetRolloffMaxDistanceMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).SetRolloffFactor as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetRolloffFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).GetRolloffFactor as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetRolloffFactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).SetRoomRolloffFactor as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetRoomRolloffFactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DSourceItf_>())).GetRoomRolloffFactor as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetRoomRolloffFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).SetRolloffModel as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetRolloffModel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).GetRolloffModel as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetRolloffModel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).SetCone as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(SetCone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DSourceItf_>())).GetCone as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DSourceItf_),
            "::",
            stringify!(GetCone)
        )
    );
}
extern "C" {
    pub static SL_IID_3DMACROSCOPIC: SLInterfaceID;
}
pub type SL3DMacroscopicItf = *const *const SL3DMacroscopicItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SL3DMacroscopicItf_ {
    pub SetSize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            width: SLmillimeter,
            height: SLmillimeter,
            depth: SLmillimeter,
        ) -> SLresult,
    >,
    pub GetSize: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            pWidth: *mut SLmillimeter,
            pHeight: *mut SLmillimeter,
            pDepth: *mut SLmillimeter,
        ) -> SLresult,
    >,
    pub SetOrientationAngles: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            heading: SLmillidegree,
            pitch: SLmillidegree,
            roll: SLmillidegree,
        ) -> SLresult,
    >,
    pub SetOrientationVectors: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            pFront: *const SLVec3D,
            pAbove: *const SLVec3D,
        ) -> SLresult,
    >,
    pub Rotate: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            theta: SLmillidegree,
            pAxis: *const SLVec3D,
        ) -> SLresult,
    >,
    pub GetOrientationVectors: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SL3DMacroscopicItf,
            pFront: *mut SLVec3D,
            pUp: *mut SLVec3D,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SL3DMacroscopicItf_() {
    assert_eq!(
        ::std::mem::size_of::<SL3DMacroscopicItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SL3DMacroscopicItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SL3DMacroscopicItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SL3DMacroscopicItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).SetSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(SetSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).GetSize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(GetSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).SetOrientationAngles as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(SetOrientationAngles)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).SetOrientationVectors as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(SetOrientationVectors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).Rotate as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(Rotate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SL3DMacroscopicItf_>())).GetOrientationVectors as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SL3DMacroscopicItf_),
            "::",
            stringify!(GetOrientationVectors)
        )
    );
}
extern "C" {
    pub static SL_IID_MUTESOLO: SLInterfaceID;
}
pub type SLMuteSoloItf = *const *const SLMuteSoloItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMuteSoloItf_ {
    pub SetChannelMute: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMuteSoloItf, chan: SLuint8, mute: SLboolean) -> SLresult,
    >,
    pub GetChannelMute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMuteSoloItf,
            chan: SLuint8,
            pMute: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetChannelSolo: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMuteSoloItf, chan: SLuint8, solo: SLboolean) -> SLresult,
    >,
    pub GetChannelSolo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMuteSoloItf,
            chan: SLuint8,
            pSolo: *mut SLboolean,
        ) -> SLresult,
    >,
    pub GetNumChannels: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMuteSoloItf, pNumChannels: *mut SLuint8) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMuteSoloItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMuteSoloItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLMuteSoloItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMuteSoloItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMuteSoloItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMuteSoloItf_>())).SetChannelMute as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMuteSoloItf_),
            "::",
            stringify!(SetChannelMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMuteSoloItf_>())).GetChannelMute as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMuteSoloItf_),
            "::",
            stringify!(GetChannelMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMuteSoloItf_>())).SetChannelSolo as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMuteSoloItf_),
            "::",
            stringify!(SetChannelSolo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMuteSoloItf_>())).GetChannelSolo as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMuteSoloItf_),
            "::",
            stringify!(GetChannelSolo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMuteSoloItf_>())).GetNumChannels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMuteSoloItf_),
            "::",
            stringify!(GetNumChannels)
        )
    );
}
extern "C" {
    pub static SL_IID_DYNAMICINTERFACEMANAGEMENT: SLInterfaceID;
}
pub type SLDynamicInterfaceManagementItf = *const *const SLDynamicInterfaceManagementItf_;
pub type slDynamicInterfaceManagementCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLDynamicInterfaceManagementItf,
        pContext: *mut ::std::os::raw::c_void,
        event: SLuint32,
        result: SLresult,
        iid: SLInterfaceID,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDynamicInterfaceManagementItf_ {
    pub AddInterface: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicInterfaceManagementItf,
            iid: SLInterfaceID,
            async_: SLboolean,
        ) -> SLresult,
    >,
    pub RemoveInterface: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicInterfaceManagementItf,
            iid: SLInterfaceID,
        ) -> SLresult,
    >,
    pub ResumeInterface: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicInterfaceManagementItf,
            iid: SLInterfaceID,
            async_: SLboolean,
        ) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLDynamicInterfaceManagementItf,
            callback: slDynamicInterfaceManagementCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLDynamicInterfaceManagementItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLDynamicInterfaceManagementItf_>(),
        32usize,
        concat!("Size of: ", stringify!(SLDynamicInterfaceManagementItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDynamicInterfaceManagementItf_>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SLDynamicInterfaceManagementItf_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicInterfaceManagementItf_>())).AddInterface as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicInterfaceManagementItf_),
            "::",
            stringify!(AddInterface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicInterfaceManagementItf_>())).RemoveInterface as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicInterfaceManagementItf_),
            "::",
            stringify!(RemoveInterface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicInterfaceManagementItf_>())).ResumeInterface as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicInterfaceManagementItf_),
            "::",
            stringify!(ResumeInterface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDynamicInterfaceManagementItf_>())).RegisterCallback
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDynamicInterfaceManagementItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
}
extern "C" {
    pub static SL_IID_MIDIMESSAGE: SLInterfaceID;
}
pub type SLMIDIMessageItf = *const *const SLMIDIMessageItf_;
pub type slMetaEventCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLMIDIMessageItf,
        pContext: *mut ::std::os::raw::c_void,
        type_: SLuint8,
        length: SLuint32,
        pData: *const SLuint8,
        tick: SLuint32,
        track: SLuint16,
    ),
>;
pub type slMIDIMessageCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLMIDIMessageItf,
        pContext: *mut ::std::os::raw::c_void,
        statusByte: SLuint8,
        length: SLuint32,
        pData: *const SLuint8,
        tick: SLuint32,
        track: SLuint16,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMIDIMessageItf_ {
    pub SendMessage: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMessageItf,
            pData: *const SLuint8,
            length: SLuint32,
        ) -> SLresult,
    >,
    pub RegisterMetaEventCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMessageItf,
            callback: slMetaEventCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub RegisterMIDIMessageCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMessageItf,
            callback: slMIDIMessageCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub AddMIDIMessageCallbackFilter: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDIMessageItf, messageType: SLuint32) -> SLresult,
    >,
    pub ClearMIDIMessageCallbackFilter:
        ::std::option::Option<unsafe extern "C" fn(self_: SLMIDIMessageItf) -> SLresult>,
}
#[test]
fn bindgen_test_layout_SLMIDIMessageItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMIDIMessageItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLMIDIMessageItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMIDIMessageItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMIDIMessageItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDIMessageItf_>())).SendMessage as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMessageItf_),
            "::",
            stringify!(SendMessage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMessageItf_>())).RegisterMetaEventCallback as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMessageItf_),
            "::",
            stringify!(RegisterMetaEventCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMessageItf_>())).RegisterMIDIMessageCallback as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMessageItf_),
            "::",
            stringify!(RegisterMIDIMessageCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMessageItf_>())).AddMIDIMessageCallbackFilter as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMessageItf_),
            "::",
            stringify!(AddMIDIMessageCallbackFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMessageItf_>())).ClearMIDIMessageCallbackFilter as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMessageItf_),
            "::",
            stringify!(ClearMIDIMessageCallbackFilter)
        )
    );
}
extern "C" {
    pub static SL_IID_MIDIMUTESOLO: SLInterfaceID;
}
pub type SLMIDIMuteSoloItf = *const *const SLMIDIMuteSoloItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMIDIMuteSoloItf_ {
    pub SetChannelMute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            channel: SLuint8,
            mute: SLboolean,
        ) -> SLresult,
    >,
    pub GetChannelMute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            channel: SLuint8,
            pMute: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetChannelSolo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            channel: SLuint8,
            solo: SLboolean,
        ) -> SLresult,
    >,
    pub GetChannelSolo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            channel: SLuint8,
            pSolo: *mut SLboolean,
        ) -> SLresult,
    >,
    pub GetTrackCount: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDIMuteSoloItf, pCount: *mut SLuint16) -> SLresult,
    >,
    pub SetTrackMute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            track: SLuint16,
            mute: SLboolean,
        ) -> SLresult,
    >,
    pub GetTrackMute: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            track: SLuint16,
            pMute: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetTrackSolo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            track: SLuint16,
            solo: SLboolean,
        ) -> SLresult,
    >,
    pub GetTrackSolo: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDIMuteSoloItf,
            track: SLuint16,
            pSolo: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMIDIMuteSoloItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMIDIMuteSoloItf_>(),
        72usize,
        concat!("Size of: ", stringify!(SLMIDIMuteSoloItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMIDIMuteSoloItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMIDIMuteSoloItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).SetChannelMute as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(SetChannelMute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).GetChannelMute as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(GetChannelMute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).SetChannelSolo as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(SetChannelSolo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).GetChannelSolo as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(GetChannelSolo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).GetTrackCount as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(GetTrackCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).SetTrackMute as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(SetTrackMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).GetTrackMute as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(GetTrackMute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).SetTrackSolo as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(SetTrackSolo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDIMuteSoloItf_>())).GetTrackSolo as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDIMuteSoloItf_),
            "::",
            stringify!(GetTrackSolo)
        )
    );
}
extern "C" {
    pub static SL_IID_MIDITEMPO: SLInterfaceID;
}
pub type SLMIDITempoItf = *const *const SLMIDITempoItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMIDITempoItf_ {
    pub SetTicksPerQuarterNote: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITempoItf, tpqn: SLuint32) -> SLresult,
    >,
    pub GetTicksPerQuarterNote: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITempoItf, pTpqn: *mut SLuint32) -> SLresult,
    >,
    pub SetMicrosecondsPerQuarterNote: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITempoItf, uspqn: SLmicrosecond) -> SLresult,
    >,
    pub GetMicrosecondsPerQuarterNote: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITempoItf, uspqn: *mut SLmicrosecond) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMIDITempoItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMIDITempoItf_>(),
        32usize,
        concat!("Size of: ", stringify!(SLMIDITempoItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMIDITempoItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMIDITempoItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDITempoItf_>())).SetTicksPerQuarterNote as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITempoItf_),
            "::",
            stringify!(SetTicksPerQuarterNote)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDITempoItf_>())).GetTicksPerQuarterNote as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITempoItf_),
            "::",
            stringify!(GetTicksPerQuarterNote)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDITempoItf_>())).SetMicrosecondsPerQuarterNote as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITempoItf_),
            "::",
            stringify!(SetMicrosecondsPerQuarterNote)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLMIDITempoItf_>())).GetMicrosecondsPerQuarterNote as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITempoItf_),
            "::",
            stringify!(GetMicrosecondsPerQuarterNote)
        )
    );
}
extern "C" {
    pub static SL_IID_MIDITIME: SLInterfaceID;
}
pub type SLMIDITimeItf = *const *const SLMIDITimeItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLMIDITimeItf_ {
    pub GetDuration: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITimeItf, pDuration: *mut SLuint32) -> SLresult,
    >,
    pub SetPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITimeItf, position: SLuint32) -> SLresult,
    >,
    pub GetPosition: ::std::option::Option<
        unsafe extern "C" fn(self_: SLMIDITimeItf, pPosition: *mut SLuint32) -> SLresult,
    >,
    pub SetLoopPoints: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDITimeItf,
            startTick: SLuint32,
            numTicks: SLuint32,
        ) -> SLresult,
    >,
    pub GetLoopPoints: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLMIDITimeItf,
            pStartTick: *mut SLuint32,
            pNumTicks: *mut SLuint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLMIDITimeItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLMIDITimeItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLMIDITimeItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLMIDITimeItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLMIDITimeItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDITimeItf_>())).GetDuration as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITimeItf_),
            "::",
            stringify!(GetDuration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDITimeItf_>())).SetPosition as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITimeItf_),
            "::",
            stringify!(SetPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDITimeItf_>())).GetPosition as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITimeItf_),
            "::",
            stringify!(GetPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDITimeItf_>())).SetLoopPoints as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITimeItf_),
            "::",
            stringify!(SetLoopPoints)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLMIDITimeItf_>())).GetLoopPoints as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLMIDITimeItf_),
            "::",
            stringify!(GetLoopPoints)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioCodecDescriptor_ {
    pub maxChannels: SLuint32,
    pub minBitsPerSample: SLuint32,
    pub maxBitsPerSample: SLuint32,
    pub minSampleRate: SLmilliHertz,
    pub maxSampleRate: SLmilliHertz,
    pub isFreqRangeContinuous: SLboolean,
    pub pSampleRatesSupported: *mut SLmilliHertz,
    pub numSampleRatesSupported: SLuint32,
    pub minBitRate: SLuint32,
    pub maxBitRate: SLuint32,
    pub isBitrateRangeContinuous: SLboolean,
    pub pBitratesSupported: *mut SLuint32,
    pub numBitratesSupported: SLuint32,
    pub profileSetting: SLuint32,
    pub modeSetting: SLuint32,
    pub streamFormat: SLuint32,
}
#[test]
fn bindgen_test_layout_SLAudioCodecDescriptor_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioCodecDescriptor_>(),
        72usize,
        concat!("Size of: ", stringify!(SLAudioCodecDescriptor_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioCodecDescriptor_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioCodecDescriptor_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).maxChannels as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(maxChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).minBitsPerSample as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(minBitsPerSample)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).maxBitsPerSample as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(maxBitsPerSample)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).minSampleRate as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(minSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).maxSampleRate as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(maxSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).isFreqRangeContinuous as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(isFreqRangeContinuous)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).pSampleRatesSupported as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(pSampleRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).numSampleRatesSupported as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(numSampleRatesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).minBitRate as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(minBitRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).maxBitRate as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(maxBitRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).isBitrateRangeContinuous as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(isBitrateRangeContinuous)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).pBitratesSupported as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(pBitratesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).numBitratesSupported as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(numBitratesSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).profileSetting as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(profileSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).modeSetting as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(modeSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioCodecDescriptor_>())).streamFormat as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioCodecDescriptor_),
            "::",
            stringify!(streamFormat)
        )
    );
}
pub type SLAudioCodecDescriptor = SLAudioCodecDescriptor_;
extern "C" {
    pub static SL_IID_AUDIODECODERCAPABILITIES: SLInterfaceID;
}
pub type SLAudioDecoderCapabilitiesItf = *const *const SLAudioDecoderCapabilitiesItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioDecoderCapabilitiesItf_ {
    pub GetAudioDecoders: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioDecoderCapabilitiesItf,
            pNumDecoders: *mut SLuint32,
            pDecoderIds: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetAudioDecoderCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioDecoderCapabilitiesItf,
            decoderId: SLuint32,
            pIndex: *mut SLuint32,
            pDescriptor: *mut SLAudioCodecDescriptor,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAudioDecoderCapabilitiesItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioDecoderCapabilitiesItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAudioDecoderCapabilitiesItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioDecoderCapabilitiesItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioDecoderCapabilitiesItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioDecoderCapabilitiesItf_>())).GetAudioDecoders as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioDecoderCapabilitiesItf_),
            "::",
            stringify!(GetAudioDecoders)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioDecoderCapabilitiesItf_>())).GetAudioDecoderCapabilities
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioDecoderCapabilitiesItf_),
            "::",
            stringify!(GetAudioDecoderCapabilities)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioEncoderSettings_ {
    pub encoderId: SLuint32,
    pub channelsIn: SLuint32,
    pub channelsOut: SLuint32,
    pub sampleRate: SLmilliHertz,
    pub bitRate: SLuint32,
    pub bitsPerSample: SLuint32,
    pub rateControl: SLuint32,
    pub profileSetting: SLuint32,
    pub levelSetting: SLuint32,
    pub channelMode: SLuint32,
    pub streamFormat: SLuint32,
    pub encodeOptions: SLuint32,
    pub blockAlignment: SLuint32,
}
#[test]
fn bindgen_test_layout_SLAudioEncoderSettings_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioEncoderSettings_>(),
        52usize,
        concat!("Size of: ", stringify!(SLAudioEncoderSettings_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioEncoderSettings_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLAudioEncoderSettings_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).encoderId as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(encoderId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).channelsIn as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).channelsOut as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).sampleRate as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).bitRate as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(bitRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).bitsPerSample as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(bitsPerSample)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).rateControl as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(rateControl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).profileSetting as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(profileSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).levelSetting as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(levelSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).channelMode as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(channelMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).streamFormat as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(streamFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).encodeOptions as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(encodeOptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderSettings_>())).blockAlignment as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderSettings_),
            "::",
            stringify!(blockAlignment)
        )
    );
}
pub type SLAudioEncoderSettings = SLAudioEncoderSettings_;
extern "C" {
    pub static SL_IID_AUDIOENCODERCAPABILITIES: SLInterfaceID;
}
pub type SLAudioEncoderCapabilitiesItf = *const *const SLAudioEncoderCapabilitiesItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioEncoderCapabilitiesItf_ {
    pub GetAudioEncoders: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioEncoderCapabilitiesItf,
            pNumEncoders: *mut SLuint32,
            pEncoderIds: *mut SLuint32,
        ) -> SLresult,
    >,
    pub GetAudioEncoderCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioEncoderCapabilitiesItf,
            encoderId: SLuint32,
            pIndex: *mut SLuint32,
            pDescriptor: *mut SLAudioCodecDescriptor,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAudioEncoderCapabilitiesItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioEncoderCapabilitiesItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAudioEncoderCapabilitiesItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioEncoderCapabilitiesItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioEncoderCapabilitiesItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderCapabilitiesItf_>())).GetAudioEncoders as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderCapabilitiesItf_),
            "::",
            stringify!(GetAudioEncoders)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderCapabilitiesItf_>())).GetAudioEncoderCapabilities
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderCapabilitiesItf_),
            "::",
            stringify!(GetAudioEncoderCapabilities)
        )
    );
}
extern "C" {
    pub static SL_IID_AUDIOENCODER: SLInterfaceID;
}
pub type SLAudioEncoderItf = *const *const SLAudioEncoderItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAudioEncoderItf_ {
    pub SetEncoderSettings: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioEncoderItf,
            pSettings: *mut SLAudioEncoderSettings,
        ) -> SLresult,
    >,
    pub GetEncoderSettings: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAudioEncoderItf,
            pSettings: *mut SLAudioEncoderSettings,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAudioEncoderItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAudioEncoderItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAudioEncoderItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAudioEncoderItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAudioEncoderItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderItf_>())).SetEncoderSettings as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderItf_),
            "::",
            stringify!(SetEncoderSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAudioEncoderItf_>())).GetEncoderSettings as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAudioEncoderItf_),
            "::",
            stringify!(GetEncoderSettings)
        )
    );
}
extern "C" {
    pub static SL_IID_BASSBOOST: SLInterfaceID;
}
pub type SLBassBoostItf = *const *const SLBassBoostItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLBassBoostItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBassBoostItf, enabled: SLboolean) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBassBoostItf, pEnabled: *mut SLboolean) -> SLresult,
    >,
    pub SetStrength: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBassBoostItf, strength: SLpermille) -> SLresult,
    >,
    pub GetRoundedStrength: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBassBoostItf, pStrength: *mut SLpermille) -> SLresult,
    >,
    pub IsStrengthSupported: ::std::option::Option<
        unsafe extern "C" fn(self_: SLBassBoostItf, pSupported: *mut SLboolean) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLBassBoostItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLBassBoostItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLBassBoostItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLBassBoostItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLBassBoostItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBassBoostItf_>())).SetEnabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBassBoostItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBassBoostItf_>())).IsEnabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBassBoostItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLBassBoostItf_>())).SetStrength as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBassBoostItf_),
            "::",
            stringify!(SetStrength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLBassBoostItf_>())).GetRoundedStrength as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBassBoostItf_),
            "::",
            stringify!(GetRoundedStrength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLBassBoostItf_>())).IsStrengthSupported as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLBassBoostItf_),
            "::",
            stringify!(IsStrengthSupported)
        )
    );
}
extern "C" {
    pub static SL_IID_PITCH: SLInterfaceID;
}
pub type SLPitchItf = *const *const SLPitchItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLPitchItf_ {
    pub SetPitch: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPitchItf, pitch: SLpermille) -> SLresult,
    >,
    pub GetPitch: ::std::option::Option<
        unsafe extern "C" fn(self_: SLPitchItf, pPitch: *mut SLpermille) -> SLresult,
    >,
    pub GetPitchCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLPitchItf,
            pMinPitch: *mut SLpermille,
            pMaxPitch: *mut SLpermille,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLPitchItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLPitchItf_>(),
        24usize,
        concat!("Size of: ", stringify!(SLPitchItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLPitchItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLPitchItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPitchItf_>())).SetPitch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPitchItf_),
            "::",
            stringify!(SetPitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLPitchItf_>())).GetPitch as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPitchItf_),
            "::",
            stringify!(GetPitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLPitchItf_>())).GetPitchCapabilities as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLPitchItf_),
            "::",
            stringify!(GetPitchCapabilities)
        )
    );
}
extern "C" {
    pub static SL_IID_RATEPITCH: SLInterfaceID;
}
pub type SLRatePitchItf = *const *const SLRatePitchItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLRatePitchItf_ {
    pub SetRate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRatePitchItf, rate: SLpermille) -> SLresult,
    >,
    pub GetRate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLRatePitchItf, pRate: *mut SLpermille) -> SLresult,
    >,
    pub GetRatePitchCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLRatePitchItf,
            pMinRate: *mut SLpermille,
            pMaxRate: *mut SLpermille,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLRatePitchItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLRatePitchItf_>(),
        24usize,
        concat!("Size of: ", stringify!(SLRatePitchItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLRatePitchItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLRatePitchItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRatePitchItf_>())).SetRate as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRatePitchItf_),
            "::",
            stringify!(SetRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLRatePitchItf_>())).GetRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRatePitchItf_),
            "::",
            stringify!(GetRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLRatePitchItf_>())).GetRatePitchCapabilities as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLRatePitchItf_),
            "::",
            stringify!(GetRatePitchCapabilities)
        )
    );
}
extern "C" {
    pub static SL_IID_VIRTUALIZER: SLInterfaceID;
}
pub type SLVirtualizerItf = *const *const SLVirtualizerItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVirtualizerItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVirtualizerItf, enabled: SLboolean) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVirtualizerItf, pEnabled: *mut SLboolean) -> SLresult,
    >,
    pub SetStrength: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVirtualizerItf, strength: SLpermille) -> SLresult,
    >,
    pub GetRoundedStrength: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVirtualizerItf, pStrength: *mut SLpermille) -> SLresult,
    >,
    pub IsStrengthSupported: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVirtualizerItf, pSupported: *mut SLboolean) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLVirtualizerItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLVirtualizerItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLVirtualizerItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVirtualizerItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLVirtualizerItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVirtualizerItf_>())).SetEnabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVirtualizerItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVirtualizerItf_>())).IsEnabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVirtualizerItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVirtualizerItf_>())).SetStrength as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVirtualizerItf_),
            "::",
            stringify!(SetStrength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVirtualizerItf_>())).GetRoundedStrength as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVirtualizerItf_),
            "::",
            stringify!(GetRoundedStrength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVirtualizerItf_>())).IsStrengthSupported as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVirtualizerItf_),
            "::",
            stringify!(IsStrengthSupported)
        )
    );
}
extern "C" {
    pub static SL_IID_VISUALIZATION: SLInterfaceID;
}
pub type SLVisualizationItf = *const *const SLVisualizationItf_;
pub type slVisualizationCallback = ::std::option::Option<
    unsafe extern "C" fn(
        pContext: *mut ::std::os::raw::c_void,
        waveform: *const SLuint8,
        fft: *const SLuint8,
        samplerate: SLmilliHertz,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLVisualizationItf_ {
    pub RegisterVisualizationCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLVisualizationItf,
            callback: slVisualizationCallback,
            pContext: *mut ::std::os::raw::c_void,
            rate: SLmilliHertz,
        ) -> SLresult,
    >,
    pub GetMaxRate: ::std::option::Option<
        unsafe extern "C" fn(self_: SLVisualizationItf, pRate: *mut SLmilliHertz) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLVisualizationItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLVisualizationItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLVisualizationItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLVisualizationItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLVisualizationItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLVisualizationItf_>())).RegisterVisualizationCallback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVisualizationItf_),
            "::",
            stringify!(RegisterVisualizationCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLVisualizationItf_>())).GetMaxRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLVisualizationItf_),
            "::",
            stringify!(GetMaxRate)
        )
    );
}
extern "C" {
    pub static SL_IID_ENGINE: SLInterfaceID;
}
pub type SLEngineItf = *const *const SLEngineItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEngineItf_ {
    pub CreateLEDDevice: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pDevice: *mut SLObjectItf,
            deviceID: SLuint32,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateVibraDevice: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pDevice: *mut SLObjectItf,
            deviceID: SLuint32,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateAudioPlayer: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pPlayer: *mut SLObjectItf,
            pAudioSrc: *const SLDataSource,
            pAudioSnk: *const SLDataSink,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateAudioRecorder: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pRecorder: *mut SLObjectItf,
            pAudioSrc: *const SLDataSource,
            pAudioSnk: *const SLDataSink,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateMidiPlayer: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pPlayer: *mut SLObjectItf,
            pMIDISrc: *const SLDataSource,
            pBankSrc: *const SLDataSource,
            pAudioOutput: *const SLDataSink,
            pVibra: *const SLDataSink,
            pLEDArray: *const SLDataSink,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateListener: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pListener: *mut SLObjectItf,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub Create3DGroup: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pGroup: *mut SLObjectItf,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateOutputMix: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pMix: *mut SLObjectItf,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateMetadataExtractor: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pMetadataExtractor: *mut SLObjectItf,
            pDataSource: *const SLDataSource,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub CreateExtensionObject: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pObject: *mut SLObjectItf,
            pParameters: *mut ::std::os::raw::c_void,
            objectID: SLuint32,
            numInterfaces: SLuint32,
            pInterfaceIds: *const SLInterfaceID,
            pInterfaceRequired: *const SLboolean,
        ) -> SLresult,
    >,
    pub QueryNumSupportedInterfaces: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            objectID: SLuint32,
            pNumSupportedInterfaces: *mut SLuint32,
        ) -> SLresult,
    >,
    pub QuerySupportedInterfaces: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            objectID: SLuint32,
            index: SLuint32,
            pInterfaceId: *mut SLInterfaceID,
        ) -> SLresult,
    >,
    pub QueryNumSupportedExtensions: ::std::option::Option<
        unsafe extern "C" fn(self_: SLEngineItf, pNumExtensions: *mut SLuint32) -> SLresult,
    >,
    pub QuerySupportedExtension: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            index: SLuint32,
            pExtensionName: *mut SLchar,
            pNameLength: *mut SLuint16,
        ) -> SLresult,
    >,
    pub IsExtensionSupported: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineItf,
            pExtensionName: *const SLchar,
            pSupported: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLEngineItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLEngineItf_>(),
        120usize,
        concat!("Size of: ", stringify!(SLEngineItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEngineItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLEngineItf_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateLEDDevice as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateLEDDevice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateVibraDevice as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateVibraDevice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateAudioPlayer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateAudioPlayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).CreateAudioRecorder as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateAudioRecorder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateMidiPlayer as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateMidiPlayer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateListener as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateListener)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).Create3DGroup as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(Create3DGroup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineItf_>())).CreateOutputMix as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateOutputMix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).CreateMetadataExtractor as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateMetadataExtractor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).CreateExtensionObject as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(CreateExtensionObject)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).QueryNumSupportedInterfaces as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(QueryNumSupportedInterfaces)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).QuerySupportedInterfaces as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(QuerySupportedInterfaces)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).QueryNumSupportedExtensions as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(QueryNumSupportedExtensions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).QuerySupportedExtension as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(QuerySupportedExtension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineItf_>())).IsExtensionSupported as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineItf_),
            "::",
            stringify!(IsExtensionSupported)
        )
    );
}
extern "C" {
    pub static SL_IID_ENGINECAPABILITIES: SLInterfaceID;
}
pub type SLEngineCapabilitiesItf = *const *const SLEngineCapabilitiesItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEngineCapabilitiesItf_ {
    pub QuerySupportedProfiles: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pProfilesSupported: *mut SLuint16,
        ) -> SLresult,
    >,
    pub QueryAvailableVoices: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            voiceType: SLuint16,
            pNumMaxVoices: *mut SLuint16,
            pIsAbsoluteMax: *mut SLboolean,
            pNumFreeVoices: *mut SLuint16,
        ) -> SLresult,
    >,
    pub QueryNumberOfMIDISynthesizers: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pNumMIDIsynthesizers: *mut SLuint16,
        ) -> SLresult,
    >,
    pub QueryAPIVersion: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pMajor: *mut SLuint16,
            pMinor: *mut SLuint16,
            pStep: *mut SLuint16,
        ) -> SLresult,
    >,
    pub QueryLEDCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pIndex: *mut SLuint32,
            pLEDDeviceID: *mut SLuint32,
            pDescriptor: *mut SLLEDDescriptor,
        ) -> SLresult,
    >,
    pub QueryVibraCapabilities: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pIndex: *mut SLuint32,
            pVibraDeviceID: *mut SLuint32,
            pDescriptor: *mut SLVibraDescriptor,
        ) -> SLresult,
    >,
    pub IsThreadSafe: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLEngineCapabilitiesItf,
            pIsThreadSafe: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLEngineCapabilitiesItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLEngineCapabilitiesItf_>(),
        56usize,
        concat!("Size of: ", stringify!(SLEngineCapabilitiesItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEngineCapabilitiesItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLEngineCapabilitiesItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QuerySupportedProfiles as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QuerySupportedProfiles)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QueryAvailableVoices as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QueryAvailableVoices)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QueryNumberOfMIDISynthesizers
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QueryNumberOfMIDISynthesizers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QueryAPIVersion as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QueryAPIVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QueryLEDCapabilities as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QueryLEDCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).QueryVibraCapabilities as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(QueryVibraCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLEngineCapabilitiesItf_>())).IsThreadSafe as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineCapabilitiesItf_),
            "::",
            stringify!(IsThreadSafe)
        )
    );
}
extern "C" {
    pub static SL_IID_THREADSYNC: SLInterfaceID;
}
pub type SLThreadSyncItf = *const *const SLThreadSyncItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLThreadSyncItf_ {
    pub EnterCriticalSection:
        ::std::option::Option<unsafe extern "C" fn(self_: SLThreadSyncItf) -> SLresult>,
    pub ExitCriticalSection:
        ::std::option::Option<unsafe extern "C" fn(self_: SLThreadSyncItf) -> SLresult>,
}
#[test]
fn bindgen_test_layout_SLThreadSyncItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLThreadSyncItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLThreadSyncItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLThreadSyncItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLThreadSyncItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLThreadSyncItf_>())).EnterCriticalSection as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLThreadSyncItf_),
            "::",
            stringify!(EnterCriticalSection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLThreadSyncItf_>())).ExitCriticalSection as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLThreadSyncItf_),
            "::",
            stringify!(ExitCriticalSection)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLEngineOption_ {
    pub feature: SLuint32,
    pub data: SLuint32,
}
#[test]
fn bindgen_test_layout_SLEngineOption_() {
    assert_eq!(
        ::std::mem::size_of::<SLEngineOption_>(),
        8usize,
        concat!("Size of: ", stringify!(SLEngineOption_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLEngineOption_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLEngineOption_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineOption_>())).feature as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineOption_),
            "::",
            stringify!(feature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLEngineOption_>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLEngineOption_),
            "::",
            stringify!(data)
        )
    );
}
pub type SLEngineOption = SLEngineOption_;
extern "C" {
    pub fn slCreateEngine(
        pEngine: *mut SLObjectItf,
        numOptions: SLuint32,
        pEngineOptions: *const SLEngineOption,
        numInterfaces: SLuint32,
        pInterfaceIds: *const SLInterfaceID,
        pInterfaceRequired: *const SLboolean,
    ) -> SLresult;
}
extern "C" {
    pub fn slQueryNumSupportedEngineInterfaces(pNumSupportedInterfaces: *mut SLuint32) -> SLresult;
}
extern "C" {
    pub fn slQuerySupportedEngineInterfaces(
        index: SLuint32,
        pInterfaceId: *mut SLInterfaceID,
    ) -> SLresult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidDataFormat_PCM_EX_ {
    pub formatType: SLuint32,
    pub numChannels: SLuint32,
    pub sampleRate: SLuint32,
    pub bitsPerSample: SLuint32,
    pub containerSize: SLuint32,
    pub channelMask: SLuint32,
    pub endianness: SLuint32,
    pub representation: SLuint32,
}
#[test]
fn bindgen_test_layout_SLAndroidDataFormat_PCM_EX_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidDataFormat_PCM_EX_>(),
        32usize,
        concat!("Size of: ", stringify!(SLAndroidDataFormat_PCM_EX_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidDataFormat_PCM_EX_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLAndroidDataFormat_PCM_EX_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).formatType as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(formatType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).numChannels as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(numChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).sampleRate as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).bitsPerSample as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(bitsPerSample)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).containerSize as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(containerSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).channelMask as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(channelMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).endianness as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(endianness)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidDataFormat_PCM_EX_>())).representation as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidDataFormat_PCM_EX_),
            "::",
            stringify!(representation)
        )
    );
}
pub type SLAndroidDataFormat_PCM_EX = SLAndroidDataFormat_PCM_EX_;
extern "C" {
    pub static SL_IID_ANDROIDEFFECT: SLInterfaceID;
}
pub type SLAndroidEffectItf = *const *const SLAndroidEffectItf_;
#[doc = " Android Effect interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidEffectItf_ {
    pub CreateEffect: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectItf,
            effectImplementationId: SLInterfaceID,
        ) -> SLresult,
    >,
    pub ReleaseEffect: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectItf,
            effectImplementationId: SLInterfaceID,
        ) -> SLresult,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectItf,
            effectImplementationId: SLInterfaceID,
            enabled: SLboolean,
        ) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectItf,
            effectImplementationId: SLInterfaceID,
            pEnabled: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SendCommand: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectItf,
            effectImplementationId: SLInterfaceID,
            command: SLuint32,
            commandSize: SLuint32,
            pCommandData: *mut ::std::os::raw::c_void,
            replySize: *mut SLuint32,
            pReplyData: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidEffectItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidEffectItf_>(),
        40usize,
        concat!("Size of: ", stringify!(SLAndroidEffectItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidEffectItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidEffectItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectItf_>())).CreateEffect as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectItf_),
            "::",
            stringify!(CreateEffect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectItf_>())).ReleaseEffect as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectItf_),
            "::",
            stringify!(ReleaseEffect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidEffectItf_>())).SetEnabled as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidEffectItf_>())).IsEnabled as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidEffectItf_>())).SendCommand as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectItf_),
            "::",
            stringify!(SendCommand)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDEFFECTSEND: SLInterfaceID;
}
pub type SLAndroidEffectSendItf = *const *const SLAndroidEffectSendItf_;
#[doc = " Android Effect Send interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidEffectSendItf_ {
    pub EnableEffectSend: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectSendItf,
            effectImplementationId: SLInterfaceID,
            enable: SLboolean,
            initialLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectSendItf,
            effectImplementationId: SLInterfaceID,
            pEnable: *mut SLboolean,
        ) -> SLresult,
    >,
    pub SetDirectLevel: ::std::option::Option<
        unsafe extern "C" fn(self_: SLAndroidEffectSendItf, directLevel: SLmillibel) -> SLresult,
    >,
    pub GetDirectLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectSendItf,
            pDirectLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
    pub SetSendLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectSendItf,
            effectImplementationId: SLInterfaceID,
            sendLevel: SLmillibel,
        ) -> SLresult,
    >,
    pub GetSendLevel: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectSendItf,
            effectImplementationId: SLInterfaceID,
            pSendLevel: *mut SLmillibel,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidEffectSendItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidEffectSendItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLAndroidEffectSendItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidEffectSendItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidEffectSendItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).EnableEffectSend as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(EnableEffectSend)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).IsEnabled as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).SetDirectLevel as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(SetDirectLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).GetDirectLevel as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(GetDirectLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).SetSendLevel as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(SetSendLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectSendItf_>())).GetSendLevel as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectSendItf_),
            "::",
            stringify!(GetSendLevel)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDEFFECTCAPABILITIES: SLInterfaceID;
}
pub type SLAndroidEffectCapabilitiesItf = *const *const SLAndroidEffectCapabilitiesItf_;
#[doc = " Android Effect Capabilities interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidEffectCapabilitiesItf_ {
    pub QueryNumEffects: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectCapabilitiesItf,
            pNumSupportedEffects: *mut SLuint32,
        ) -> SLresult,
    >,
    pub QueryEffect: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidEffectCapabilitiesItf,
            index: SLuint32,
            pEffectType: *mut SLInterfaceID,
            pEffectImplementation: *mut SLInterfaceID,
            pName: *mut SLchar,
            pNameSize: *mut SLuint16,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidEffectCapabilitiesItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidEffectCapabilitiesItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAndroidEffectCapabilitiesItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidEffectCapabilitiesItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidEffectCapabilitiesItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectCapabilitiesItf_>())).QueryNumEffects as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectCapabilitiesItf_),
            "::",
            stringify!(QueryNumEffects)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidEffectCapabilitiesItf_>())).QueryEffect as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidEffectCapabilitiesItf_),
            "::",
            stringify!(QueryEffect)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDCONFIGURATION: SLInterfaceID;
}
#[doc = " Android Configuration interface methods"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidConfigurationItf_ {
    _unused: [u8; 0],
}
pub type SLAndroidConfigurationItf = *const *const SLAndroidConfigurationItf_;
extern "C" {
    pub static SL_IID_ANDROIDSIMPLEBUFFERQUEUE: SLInterfaceID;
}
pub type SLAndroidSimpleBufferQueueItf = *const *const SLAndroidSimpleBufferQueueItf_;
pub type slAndroidSimpleBufferQueueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLAndroidSimpleBufferQueueItf,
        pContext: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " Android simple buffer queue state"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidSimpleBufferQueueState_ {
    pub count: SLuint32,
    pub index: SLuint32,
}
#[test]
fn bindgen_test_layout_SLAndroidSimpleBufferQueueState_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidSimpleBufferQueueState_>(),
        8usize,
        concat!("Size of: ", stringify!(SLAndroidSimpleBufferQueueState_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidSimpleBufferQueueState_>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SLAndroidSimpleBufferQueueState_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueState_>())).count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueState_),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueState_>())).index as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueState_),
            "::",
            stringify!(index)
        )
    );
}
pub type SLAndroidSimpleBufferQueueState = SLAndroidSimpleBufferQueueState_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidSimpleBufferQueueItf_ {
    pub Enqueue: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidSimpleBufferQueueItf,
            pBuffer: *const ::std::os::raw::c_void,
            size: SLuint32,
        ) -> SLresult,
    >,
    pub Clear: ::std::option::Option<
        unsafe extern "C" fn(self_: SLAndroidSimpleBufferQueueItf) -> SLresult,
    >,
    pub GetState: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidSimpleBufferQueueItf,
            pState: *mut SLAndroidSimpleBufferQueueState,
        ) -> SLresult,
    >,
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidSimpleBufferQueueItf,
            callback: slAndroidSimpleBufferQueueCallback,
            pContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidSimpleBufferQueueItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidSimpleBufferQueueItf_>(),
        32usize,
        concat!("Size of: ", stringify!(SLAndroidSimpleBufferQueueItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidSimpleBufferQueueItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidSimpleBufferQueueItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueItf_>())).Enqueue as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueItf_),
            "::",
            stringify!(Enqueue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueItf_>())).Clear as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueItf_),
            "::",
            stringify!(Clear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueItf_>())).GetState as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueItf_),
            "::",
            stringify!(GetState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidSimpleBufferQueueItf_>())).RegisterCallback as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidSimpleBufferQueueItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDBUFFERQUEUESOURCE: SLInterfaceID;
}
pub type SLAndroidBufferQueueItf = *const *const SLAndroidBufferQueueItf_;
#[repr(C)]
#[derive(Debug)]
pub struct SLAndroidBufferItem_ {
    pub itemKey: SLuint32,
    pub itemSize: SLuint32,
    pub itemData: __IncompleteArrayField<SLuint8>,
}
#[test]
fn bindgen_test_layout_SLAndroidBufferItem_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidBufferItem_>(),
        8usize,
        concat!("Size of: ", stringify!(SLAndroidBufferItem_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidBufferItem_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLAndroidBufferItem_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidBufferItem_>())).itemKey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferItem_),
            "::",
            stringify!(itemKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidBufferItem_>())).itemSize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferItem_),
            "::",
            stringify!(itemSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidBufferItem_>())).itemData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferItem_),
            "::",
            stringify!(itemData)
        )
    );
}
pub type SLAndroidBufferItem = SLAndroidBufferItem_;
pub type slAndroidBufferQueueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        caller: SLAndroidBufferQueueItf,
        pCallbackContext: *mut ::std::os::raw::c_void,
        pBufferContext: *mut ::std::os::raw::c_void,
        pBufferData: *mut ::std::os::raw::c_void,
        dataSize: SLuint32,
        dataUsed: SLuint32,
        pItems: *const SLAndroidBufferItem,
        itemsLength: SLuint32,
    ) -> SLresult,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidBufferQueueState_ {
    pub count: SLuint32,
    pub index: SLuint32,
}
#[test]
fn bindgen_test_layout_SLAndroidBufferQueueState_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidBufferQueueState_>(),
        8usize,
        concat!("Size of: ", stringify!(SLAndroidBufferQueueState_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidBufferQueueState_>(),
        4usize,
        concat!("Alignment of ", stringify!(SLAndroidBufferQueueState_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueState_>())).count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueState_),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueState_>())).index as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueState_),
            "::",
            stringify!(index)
        )
    );
}
pub type SLAndroidBufferQueueState = SLAndroidBufferQueueState_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidBufferQueueItf_ {
    pub RegisterCallback: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidBufferQueueItf,
            callback: slAndroidBufferQueueCallback,
            pCallbackContext: *mut ::std::os::raw::c_void,
        ) -> SLresult,
    >,
    pub Clear:
        ::std::option::Option<unsafe extern "C" fn(self_: SLAndroidBufferQueueItf) -> SLresult>,
    pub Enqueue: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidBufferQueueItf,
            pBufferContext: *mut ::std::os::raw::c_void,
            pData: *mut ::std::os::raw::c_void,
            dataLength: SLuint32,
            pItems: *const SLAndroidBufferItem,
            itemsLength: SLuint32,
        ) -> SLresult,
    >,
    pub GetState: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidBufferQueueItf,
            pState: *mut SLAndroidBufferQueueState,
        ) -> SLresult,
    >,
    pub SetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(self_: SLAndroidBufferQueueItf, eventFlags: SLuint32) -> SLresult,
    >,
    pub GetCallbackEventsMask: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidBufferQueueItf,
            pEventFlags: *mut SLuint32,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidBufferQueueItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidBufferQueueItf_>(),
        48usize,
        concat!("Size of: ", stringify!(SLAndroidBufferQueueItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidBufferQueueItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidBufferQueueItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).RegisterCallback as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(RegisterCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).Clear as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(Clear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).Enqueue as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(Enqueue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).GetState as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(GetState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).SetCallbackEventsMask as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(SetCallbackEventsMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidBufferQueueItf_>())).GetCallbackEventsMask as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidBufferQueueItf_),
            "::",
            stringify!(GetCallbackEventsMask)
        )
    );
}
#[doc = " BufferQueue-based data locator definition where locatorType must"]
#[doc = "  be SL_DATALOCATOR_ANDROIDSIMPLEBUFFERQUEUE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_AndroidSimpleBufferQueue {
    pub locatorType: SLuint32,
    pub numBuffers: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_AndroidSimpleBufferQueue() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_AndroidSimpleBufferQueue>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SLDataLocator_AndroidSimpleBufferQueue)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_AndroidSimpleBufferQueue>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SLDataLocator_AndroidSimpleBufferQueue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_AndroidSimpleBufferQueue>())).locatorType
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_AndroidSimpleBufferQueue),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_AndroidSimpleBufferQueue>())).numBuffers
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_AndroidSimpleBufferQueue),
            "::",
            stringify!(numBuffers)
        )
    );
}
#[doc = " Android Buffer Queue-based data locator definition,"]
#[doc = "  locatorType must be SL_DATALOCATOR_ANDROIDBUFFERQUEUE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLDataLocator_AndroidBufferQueue_ {
    pub locatorType: SLuint32,
    pub numBuffers: SLuint32,
}
#[test]
fn bindgen_test_layout_SLDataLocator_AndroidBufferQueue_() {
    assert_eq!(
        ::std::mem::size_of::<SLDataLocator_AndroidBufferQueue_>(),
        8usize,
        concat!("Size of: ", stringify!(SLDataLocator_AndroidBufferQueue_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLDataLocator_AndroidBufferQueue_>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SLDataLocator_AndroidBufferQueue_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_AndroidBufferQueue_>())).locatorType as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_AndroidBufferQueue_),
            "::",
            stringify!(locatorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLDataLocator_AndroidBufferQueue_>())).numBuffers as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SLDataLocator_AndroidBufferQueue_),
            "::",
            stringify!(numBuffers)
        )
    );
}
pub type SLDataLocator_AndroidBufferQueue = SLDataLocator_AndroidBufferQueue_;
extern "C" {
    pub static SL_IID_ANDROIDACOUSTICECHOCANCELLATION: SLInterfaceID;
}
pub type SLAndroidAcousticEchoCancellationItf = *const *const SLAndroidAcousticEchoCancellationItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidAcousticEchoCancellationItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidAcousticEchoCancellationItf,
            enabled: SLboolean,
        ) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidAcousticEchoCancellationItf,
            pEnabled: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidAcousticEchoCancellationItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidAcousticEchoCancellationItf_>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SLAndroidAcousticEchoCancellationItf_)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidAcousticEchoCancellationItf_>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SLAndroidAcousticEchoCancellationItf_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidAcousticEchoCancellationItf_>())).SetEnabled as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidAcousticEchoCancellationItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidAcousticEchoCancellationItf_>())).IsEnabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidAcousticEchoCancellationItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDAUTOMATICGAINCONTROL: SLInterfaceID;
}
pub type SLAndroidAutomaticGainControlItf = *const *const SLAndroidAutomaticGainControlItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidAutomaticGainControlItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidAutomaticGainControlItf,
            enabled: SLboolean,
        ) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidAutomaticGainControlItf,
            pEnabled: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidAutomaticGainControlItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidAutomaticGainControlItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAndroidAutomaticGainControlItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidAutomaticGainControlItf_>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SLAndroidAutomaticGainControlItf_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidAutomaticGainControlItf_>())).SetEnabled as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidAutomaticGainControlItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidAutomaticGainControlItf_>())).IsEnabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidAutomaticGainControlItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
}
extern "C" {
    pub static SL_IID_ANDROIDNOISESUPPRESSION: SLInterfaceID;
}
pub type SLAndroidNoiseSuppressionItf = *const *const SLAndroidNoiseSuppressionItf_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SLAndroidNoiseSuppressionItf_ {
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(self_: SLAndroidNoiseSuppressionItf, enabled: SLboolean) -> SLresult,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            self_: SLAndroidNoiseSuppressionItf,
            pEnabled: *mut SLboolean,
        ) -> SLresult,
    >,
}
#[test]
fn bindgen_test_layout_SLAndroidNoiseSuppressionItf_() {
    assert_eq!(
        ::std::mem::size_of::<SLAndroidNoiseSuppressionItf_>(),
        16usize,
        concat!("Size of: ", stringify!(SLAndroidNoiseSuppressionItf_))
    );
    assert_eq!(
        ::std::mem::align_of::<SLAndroidNoiseSuppressionItf_>(),
        8usize,
        concat!("Alignment of ", stringify!(SLAndroidNoiseSuppressionItf_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidNoiseSuppressionItf_>())).SetEnabled as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidNoiseSuppressionItf_),
            "::",
            stringify!(SetEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SLAndroidNoiseSuppressionItf_>())).IsEnabled as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SLAndroidNoiseSuppressionItf_),
            "::",
            stringify!(IsEnabled)
        )
    );
}
